{"pages":[],"posts":[{"title":"NSSpain 2013 \"Foldify - history of development and lessons learned\" by Krzysztof Zabłocki","text":"","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2013-Foldify-history-of-development-and-lessons-learned-by-Krzysztof-Zablocki/"},{"title":"NSSpain 2014 \"Autolayout for everyone\" by Krzysztof Kucharewicz","text":"IntroductionForget about frames, forget about multiple nibs for each view controller. Autolayouts are here to solve complex relations between UI objects and make a robust UI that will hopefully require less maintenance with the introduction of new device form factors.MotivationAutolayouts first appeared in iOS 6 and XCode 4.6. They constituted a big change in interface design. A complex set of rules was introduced for UI implementation. Let’s be honest, this was not a good start since Interface Builder at the beginning was trying to be smarter than the developer and was modifying the designs in an often unwanted way.The programatically applied interfaces have been introduced as the alternative to IB, but the NSLayoutConstraint’s lengthy method constraintWithItem: scares many programmers and the ASCII­art from constraintsWithVisualFormat: gives a headache at the first glance.The issues with IB are pretty much in the past. It’s now way easier to create desired constraints and debug them in the XCode 5.0+. Open source programmers have not been lagging behind and we can now find libraries helping with the interface design in code.During my daily work I can see that the Autolayout is being more and more used in the interface design, but when it comes to dynamic changes in the interface (and animations in particular) many programmers revert to the “comfort zone” of pixels and frames. All that can obviously be done using autolayouts, easier than you might have thought.The TalkI’ll show how to create layouts that adjust to both iPhone and iPad design and respond adequately to the changing content.I’ll present how to interpret and fix warnings and errors that are presented in the Interface Builder. I’ll show when and how to create and manipulate autolayout constraints in code and create fun animations.I’ll introduce the Lyt library (https://github.com/robotmedia/Lyt).As an addition I’ll also introduce the NibWrapper library for modular interface design that plays very well with Autolayouts (https://github.com/mobilejazz/NibWrapper). +info: https://github.com/mobiosis/NSSpain-autolayout-test","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Autolayout-for-everyone-by-Krzysztof-Kucharewicz/"},{"title":"NSSpain 2014 \"Can't handle my scale\" by Michele Titolo","text":"Scaling an app means many things. They can be human things, like “how do I stop someone from overwriting my changes to the project.pbxproj, storyboard, or xib?” Or development things, like “how do I manage dependencies?” and “why do I always have to do a 3-way merge?” Or even peripheral things like “what happens to our servers if we get featured?” and “what happens to the app when the servers go down?” This session will cover common scaling problems, and solutions to overcome them.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Can't-handle-my-scale-by-Michele-Titolo/"},{"title":"NSSpain 2014 Interview with Ash Furrow","text":"NSSpain Interview: Ash Furrow talks about Swift and his upcoming book.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Ash-Furrow/"},{"title":"NSSpain 2014 Interview with Enric Enrich and Jaime Paulo","text":"NSSpain Interview: Enric Enrich and Jaime Paulo","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Enric-Enrich-and-Jaime-Paulo/"},{"title":"NSSpain 2014 Interview with Orta Therox","text":"Stefan Völker talks with Orta Therox about his “A Swift Start”","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Orta-Therox/"},{"title":"NSSpain 2014 \"Swift and C\" by Mike Ash","text":"Swift provides rich facilities for OO and functional programming, but it also allows extensive bridging to C APIs. Learn all about how to call C functions, work with “unsafe” pointers, manage memory, and more.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Swift-and-C-by-Mike-Ash/"},{"title":"NSSpain 2014 \"What to do when you get hacked ?\" by Andrew Yates","text":"As you may know Buffer got hacked last October. They gained access to access tokens through our database and then used them to start posting out to the users Twitter and Facebook accounts. Not many companies or people are very open about what happens when they get hacked. Keeping things very secretive before sending out a mass email to everyone days or even weeks after first discovering the issue. Buffer is transparent about a lot of things from salaries to how much money is in the bank so we hit the breach head on. I will talk more about the iOS side of things. The expedited reviews and the changes we put in place within the app after.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-What-to-do-when-you-get-hacked-by-Andrew-Yates/"},{"title":"Best Of NSSpain 2014","text":"Have a brief look why NSSpain was one of THE events in 2014! If you’re interested in coming this year, take a look at our website! There you can find our current (and incredible!) line up of speakers, and all the info about the event! -&gt; http://nsspain.com/","link":"/NSSpain/2015/NSSpain-2015-Best-Of-NSSpain-2014/"},{"title":"All the [tech] world's a stage - Michele Titolo","text":"Creativity, collaboration, and ever-more-complex technology. While we like to think these characteristics are unique to software development, they’ve defined the theatrical arts for centuries. Putting on a show requires teamwork, accountability, problem solving, and disaster recovery, all within strict time and resource constraints. Sound familiar? This session will explore history, art, communication, and how to build something that brings delight to all who see it. Michele TitoloNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-All-the-tech-world's-a-stage-Michele-Titolo/"},{"title":"Digging Deeper Understanding HTTP - Daniel Eggert","text":"This talk is focusses on how TCP/IP and HTTP play together to help make good decisions that can dramatically improve the performance for network intensive apps. The talk is based on my article “IP, TCP, and HTTP” http://www.objc.io/issues/10-syncing-data/ip-tcp-http/ but also steps into the territory of SPDY and HTTP/2 to talk about how these help network performance. Broad outline: IP — The Internet ProtocolWhat does it do? Packets and routing. TCP - Reliable StreamsTurning best-effort into reliableHow does a TCP connection work?Connection setup, data flow, and congestion control HTTP/1.1The lingua france of the internet“Request and Response” patternThe challenges of HTTP/1.1 -&gt; verbose, connection re-use, … HTTP/2The internet has evolved.Which problems does HTTP/2 solve?How to use HTTP/2 efficiently? Daniel EggertNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Digging-Deeper-Understanding-HTTP-Daniel-Eggert/"},{"title":"Diving Into HomeKit - Taylan Pince","text":"This talk will cover the basics of building a HomeKit driven app as well as an Arduino based hardware prototype that you can control via the iOS app. My aim is to give a solid introduction to hardware prototyping while also focusing on one of Apple’s hottest new frameworks. We will step through how to approach a custom built light control and door buzzer system while integrating them with remote controls via Siri. Taylan PinceNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Diving-Into-HomeKit-Taylan-Pince/"},{"title":"Bringing CocoaPods to Linux - Boris Bügling","text":"With Swift coming to Linux, it was clear that we also wanted to be there with CocoaPods, ideally offering a solution for managing dependencies of Swift projects on Linux as early as possible. The main major challenge of this is CocoaPods’ historic entanglement with Xcode, a topic which we wanted to resolve for other reasons already (see https://github.com/CocoaPods/CocoaPods/issues/2729). In this talk, we’ll learn a lot about Xcode’s build system and how we are replacing it with a more direct connection to the build toolchain to break our dependance on Xcode. This talk will also discuss two alternatives to using Xcode as the build system, GNU Makefiles and Facebook’s Buck, considering the pros and cons. Boris BüglingNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Bringing-CocoaPods-to-Linux-Boris-Bugling/"},{"title":"DevOps in the iOS world - Piet Brauer","text":"Mobile application development has many different facets, from independent developers to teams of 50 developers working on the same code base. While other developer groups, e.g. web application had scaling problems in the past and came up with solutions like DevOps, Mobile application development is stuck in the past. This talk is to explore DevOps techniques like Continuous Integration, Continuous deployment and more in the iOS domain.I worked for small agencies, big companies and helped scaling teams and development processes from 1-2 people to 16 people spread across Europe. I recently started a blog series about this very topic over here: http://nerdishbynature.com/post/2015/05/28/devops-introduction.html Piet BrauerNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-DevOps-in-the-iOS-world-Piet-Brauer/"},{"title":"Functions, a love affair - Josh Abernathy","text":"Big, complex things are made out of many little, simple things—or least they should be. Simple things are easier to write, easier to debug, and easier to change. Functions are beautifully simple. Composing them lets us make big things out of small things. By thinking differently about app architecture, we can start to build our apps out of smaller, simpler things. Josh AbernathyNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Functions-a-love-affair-Josh-Abernathy/"},{"title":"Empathy coding innocent - Hermes Pique","text":"We strive to make our apps surprise and delight users. Sometimes it’s about spending hours tweaking an animation to make it pop. And sometimes it’s about closing our eyes and using our app with VoiceOver on. I’d like to share with you my experience making apps accessible at Facebook. Hermes PiqueNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Empathy-coding-innocent-Hermes-Pique/"},{"title":"Getting Ahead of the Curve - Adam Bell","text":"A deep-dive into how awesome prototyping can be when you’re playing with unreleased features that you’ve reverse engineered… all the while beatings others to the punch. Adam BellNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Getting-Ahead-of-the-Curve-Adam-Bell/"},{"title":"Humanities X Technology - Ashley Nelson-Hornstein","text":"What does it mean to approach software and hiring with the perspective of Steve Jobs, that its “Apple’s DNA that technology alone is not enough - it’s technology married with liberal arts, married with the humanities, that yields us the results that make our heart sing?” Ashley Nelson-HornsteinNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Humanities-X-Technology-Ashley-Nelson-Hornstein/"},{"title":"Hardware-assisted debugging - Philippe Casgrain","text":"Reproducing a bug can sometimes be tricky, especially if you have to type a lot or move the mouse. And sometimes you can’t use Automator or other scripting engines because you suspect that may just hide the bug. With the help of an Arduino board, Philippe will show you how to cheaply emulate a USB keyboard and mouse with randomized or predictive inputs so you can do something more productive than repetitive typing. This presentation will contain a minimal amount of code and a live demo. Philippe CasgrainNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Hardware-assisted-debugging-Philippe-Casgrain/"},{"title":"Going swiftly to a Functional world - Ana Márquez & Javier de Silóniz","text":"Introducing Second Bridge: a Swift framework that introduces several new functional concepts to the language with a Scala-like syntax. We’ll present to the guests new data types that come from the Scala/Haskell world, and new patterns that can make your programming better. Ana Márquez &amp; Javier de SilónizNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Going-swiftly-to-a-Functional-world-Ana-Marquez-and-Javier-de-Siloniz/"},{"title":"Indie Rock and Roll - Airplane Mode","text":"In addition to being an indie rock band, Dave Wiskus and Joe Cieplinski are also designers, businessmen, and veterans of the Apple development community. They’ll talk about how their approach to art affected their technical work, and how their experience designing for iOS and working in a community that fosters an independent spirit has enabled them to make money as musicians. Airplane ModeNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Indie-Rock-and-Roll-Airplane-Mode/"},{"title":"Learn, Compete and Win. An introduction to Topcoder - Charlie Cowan","text":"In this session learn how to up your iOS app dev skills, win cash prizes, and compete in our iOS community. On topcoder you can prove your iOS skills by earning our iOS topcoder badges and gain exclusive access to iOS challenges, as well as special community-related events and info, all while being paid to build real world enterprise iOS apps! Charlie CowanNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Learn-Compete-and-Win.-An-introduction-to-Topcoder-Charlie-Cowan/"},{"title":"Learning security by being smiling_imp - Daniel Haight","text":"We’ll learn about levels of security on the iOS and OS X platforms by a series of Sneaky Hacks™. The talk will be a set of demos that will demonstrate vulnerabilities increasing in severity and difficulty as well as how to avoid them happening to you or the apps you build. Most of the content will be relevant and actionable to anyone creating iOS apps. Anything that isn’t will be super entertaining 😸. Things that will be covered: 1) Get the user to download an app: We’ll write an app that can steal keychain credentials We’ll patch a version of an app the user already has (e.g. Twitter) to dump secure data. 2) Access a network the user is on: Intercept some network traffic from an app that isn’t our own 3) Get root access: Attach debugserver to app, use LLDB on a 3rd party app/ Tweek 3rd party apps (make all twitter photos cats) Tweek system (OS processes). Draw something on the lock screen. Access to 3rd party apps’ data (passwords/tokens etc). Set up remote access (for next demo) 4) Get remote access: A real time mitm server dumping all network traffic. Daniel HaightNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Learning-security-by-being-smiling_imp-Daniel-Haight/"},{"title":"Intelligent UI with AsyncDisplayKit 2.0 - Scott Goodson","text":"Intelligent UI with AsyncDisplayKit 2.0 Scott GoodsonNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Intelligent-UI-with-AsyncDisplayKit-2.0-Scott-Goodson/"},{"title":"Let’s Play Refactor the Mega-Controller - Andy Matuschak","text":"So you’ve got this huge view controller that knows about everything, and it’s become some kind of puppeteer mastermind whose responsibilities have somehow grown to simultaneously encompass disk I/O and navigation bar styling. You’re supposed to change its behavior significantly, but you have zero confidence that you can do this without breaking the world. Together, we’ll refactor a tangled view controller, unit test it without tons of stubbing goo, and make it easier to change over time. We’ll use general strategies that you can deploy without coming off as some kind of high-falutin’ academic. Andy MatuschakNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Lets-Play-Refactor-the-Mega-Controller-Andy-Matuschak/"},{"title":"Making Sense of Xcode - Grant Paul","text":"Tips and tricks to understand how Xcode works, so you’ll never (hopefully) see a broken build again. Grant PaulNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Making-Sense-of-Xcode-Grant-Paul/"},{"title":"Mobile Continuous Integration at SoundCloud - Vincent Garrigues","text":"In the past two years at SoundCloud, we’ve shipped a brand new iPhone and iPad app and completely transformed the way we work. The team scaled from 3 to 10 developers, we’ve moved away from pull-requests and rely heavily on automated testing. As SoundCloud grew, its backend infrastructure got more complex with the addition of many microservices. Ensuring our apps to work with these microservices in production is key to SoundCloud’s continuing success. That’s why we’re building custom continuous integration solutions for our mobile apps. Vincent GarriguesNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Mobile-Continuous-Integration-at-SoundCloud-Vincent-Garrigues/"},{"title":"Poor man's functional programming - Miguel Quiñones","text":"Getting started with new paradigms requires us to change thinking and make mistakes along the way. Functional programming from the eyes of a beginner, along with practical steps to gradually change how we write our code. Miguel QuiñonesNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Poor-man's-functional-programming-Miguel-Quinones/"},{"title":"Presenting Coordinators - Soroush Khanlou","text":"In my talk, I’ll present coordinators, which are a novel way to manage view controllers, enable re-use, and generally provide structure to code. Coordinators are objects that control flow in an app. Coordinators are typically initialized with a navigation controller, although they can manage other types of view controllers as well. View controllers are totally transparent to coordinators; view controllers display data as directed by their coordinator and bubble up events as delegate methods, which the coordinators respond to. This makes reusing view controllers completely trivial, since the view controller doesn’t bring any baggage along with it. Much like views and view controllers, coordinators are found in a tree structure. The root coordinator is called the app coordinator, and contains the code for setting up the root view controller, which you might typically find in an app delegate. Swapping out app coordinators could change your app from an iPad layout to an iPhone layout. When a coordinator begins doing too many tasks, those tasks can be pushed down into a child coordinator. Complexity can easily be managed, and it has space for growth. The using the coordinator model is a simpler way of managing iOS apps and is a great tool for slimming down large view controllers. Soroush KhanlouNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Presenting-Coordinators-Soroush-Khanlou/"},{"title":"The Zen Guide to WatchOS 2 - Natasha Murashev","text":"At WWDC15, WatchKit got a HUGE upgrade. Hello WatchOS 2! Learn the ins and outs of how the iOS and Watch App should work together to make the best user experience on the Apple Watch for your app. Natasha MurashevNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-The-Zen-Guide-to-WatchOS-2-Natasha-Murashev/"},{"title":"Welcome - NSSpain","text":"Luis Ascorbe &amp; Borja ReinaresNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Welcome-NSSpain/"},{"title":"Team Leadership Lessons Learned The Hard Way - Michael May","text":"Over the past few years I have led a number of iOS teams, at various different companies in London, from digital agencies to large publishing houses. As you might expect we’ve enjoyed a lot of highs, and more than a few lows. In this talk I want to reflect on some of the lows, and my part in them. When the best of intentions goes awry, and you find yourself needing to be the best team lead you can be, what should you do first? How can you turn a toxic situation into a team building one? When teams turn on themselves, how do you pull it back? And when you’ve had an argument with another team mate that was so aggressive that your CTO had to step in, how do you end up calling that same developer a close friend? Naming no names but my own, I plan to tell you some of the challenges I’ve faced, what I did next and what I learned along the way so that, maybe, you don’t have to walk the same road too. Michael MayNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Team-Leadership-Lessons-Learned-The-Hard-Way-Michael-May/"},{"title":"Building Buddybuild - Dennis Pilarinos","text":"Building iOS apps is difficult enough, without having to worry about building your build system as well. Dennis and a couple of friends, while building an iOS app themselves, grew so frustrated that with existing developer tools, they decided to put the app on hold and build a better platform for all mobile developers. Today, buddybuild helps thousands of development teams, build &amp; test their code, deploy their apps, collect feedback and crash reports from their users - all with very little setup and maintenance. Dennis will tell the story of how buddybuild was created, and share some of the best practices he’s learned from thousands of development teams. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Building-Buddybuild-Dennis-Pilarinos/"},{"title":"While Your App was Sleeping - Panel Discussion","text":"In our increasingly international market, internet speeds are not created equal, so having an immediately responsive and up to date app is essential. With the recent introduction of Background Transfer Service and Background Fetch, iOS apps can perform networking requests in the background. Whether it’s downloading assets, uploading large files, opening your app with fresh data, or getting data to your watch app, this new user experience is incredibly powerful. This panel will cover how different companies are leveraging this framework, architectures for the networking stack, and how to navigate development speed bump. Gwendolyn Weston Natasha Murashev Boris Bügling Michele TitoloNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-While-Your-App-was-Sleeping-Panel-Discussion/"},{"title":"Asymmetric Cryptography Between iOS and the Rest of the World - Ignacio Nieto","text":"Apple deprecated and then discontinued OpenSSL for its platforms and OS some years ago, leaving us with access to cryptography only through the Security framework. Unless, of course, you want to do some nasty hacks with custom built openssl libraries. Unfortunately, the Security framework is not well documented, isn’t specially developer friendly, and has not been thought to interact with 3rd parties, such as external servers making use of standard public key infrastructures and libraries such as OpenSSL. However, nowadays, it’s a common requisite for our apps to interact with secure backends and RESTful APIs making use of asymmetric cryptography, KPIs or public key systems. In this presentation, I will explain how to make your iOS application interact with these external public key infrastructures, importing keys from external entities (probably generated via OpenSSL) and exporting the keys generated at the device so they can be used in signature and verification operations externally. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Asymmetric-Cryptography-Between-iOS-and-the-Rest-of-the-World-Ignacio-Nieto/"},{"title":"“Why Swift?” for everyone else and so much more - Ayaka Nonaka","text":"The Venmo iOS team has spent the past 8 weeks rewriting our entire app (full of crufty old code dating back to 2011) in Swift. There were a lot of great things that we got out of this, but one of the biggest questions that we get is “That’s awesome, but how do I convince the rest of my team/company/stakeholders that it’s worth it?” This talk will cover subtle techniques and pitfalls to avoid to get what you want and how to apply it to other situations like giving code review feedback and working as a team in general. Ayaka NonakaNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Why-Swift-for-everyone-else-and-so-much-more-Ayaka-Nonaka/"},{"title":"Building an IDE for iOS - Mark Villacampa","text":"On iOS 11, iPads are becoming much more useful productivity and content creation tools. With Apple’s push for Playgrounds.app and more permissive AppStore rules towards developer tools, it’s clear Apple wants us to write code on iOS. But is this all that’s needed to have world class IDEs for iOS? We’ll start with a walkthrough of the history and state of the art of iOS IDEs and related developer tools (developer-friendly text editors, git clients, terminal emulators, etc.). You’ll learn how Playgrounds.app works and what special rules it takes advantage of. We’ll go through the AppStore rules for developer tools, and what changed recently to allow more powerful IDEs. We’ll imagine how an IDE could look like on a multitouch device with new UIs and interactions, and what iOS 11 features we can leverage. A key feature of an IDE is executing code. We’ll learn how this is possible on iOS, its limitations, and the difference between interpreted, JITed and compiled execution. We’ll figure out what needs to change before we can have true desktop-grade IDEs on our iOS devices and put together an iOS 12 feature wishlist. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Building-an-IDE-for-iOS-Mark-Villacampa/"},{"title":"Code snippets for Debugging - Carola Nitz","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Code-snippets-for-Debugging-Carola-Nitz/"},{"title":"Disassembly for Fun and Profit - Alexsander Akers","text":"Apple’s system frameworks make a lot of functionality available to us developers, from auto layout to calendrical calculations, locales, and formatting. Although the internal workings of these classes are not available to us, some implementation details are actually open source: auto layout is built on the Cassowary project, while NSCalendar, NSLocale, and the NSFormatter subclasses are built on top of the icucore framework. But because these projects are open-source, there’s nothing stopping us from seeing how they work under the hood. However, Apple does keep some goodies to themselves (persistent Touch Bar items) and some system functionalities are only available through opaque mechanisms (AirDrop through UIActivityController). In this talk I detail how to search for hidden functionality, the wonders of disassembly and decompilation, and how to follow the code trails through to the methods you want. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Disassembly-for-Fun-and-Profit-Alexsander-Akers/"},{"title":"Creating a Computer Vision Machine Learning App From The Ground Up - Jorge Molina & George Karavias","text":"Core ML, Apple’s new foundational machine learning framework, is blazingly fast not to mention dead easy to incorporate in an app. To top that off Core ML boasts support for a broad variety of machine learning model types and provides a Python package to convert them. But how do you actually create and train a model to begin with? Join us as we go step by step through the whole process:Acquiring training dataCreating, training and optimising the modelConverting the model to Core ML and integrating itWiring Core ML to the Vision frameworkTo create a computer vision machine learning app. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Creating-a-Computer-Vision-Machine-Learning-App-From-The-Ground-Up-Jorge-Molina-and-George-Karavias/"},{"title":"Effective Remote Communication - Peter Steinberger","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Effective-Remote-Communication-Peter-Steinberger/"},{"title":"Everyone is an API designer - John Sundell","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Everyone-is-an-API-designer-John-Sundell/"},{"title":"Dynamic Mocks in Swift - Victor Pimentel","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Dynamic-Mocks-in-Swift-Victor-Pimentel/"},{"title":"Facing the VIPER - Esteban Torres","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Facing-the-VIPER-Esteban-Torres/"},{"title":"Gems of GameplayKit - Tobias Due Munk","text":"GameplayKit might seem to be all about games, but it contains valuable gems that are perfect to be used in regular apps. Some of the things you can use from GameplayKit in a non-game are: ‘QuadTree’ for clustered of annotations on zoomable views, just like MapKit does in iOS 11. ‘Procedural Noise’ for natural random animations ‘Perceptual Randomization’ for better™ shuffled playlists …or, why Steve Jobs said “We’re making it less, to make it feel more random”. Non-uniform randomness like Gaussian, when uniform random just isn’t suitable. ‘R-Tree’ for performant rubber band selection like MindNode uses for the CALayer backed view hierarchy. ‘Pathfinding’ for step by step navigation in indoor museums. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Gems-of-GameplayKit-Tobias-Due-Munk/"},{"title":"Growing - Roy Marmelstein","text":"Scale changes everything. In this talk I will share learnings from my experiences of working on projects of varying sizes. We will discuss iOS development when scaling teams on products with a growing user base and a growing codebase and the kind of problems you encounter along the way. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Growing-Roy-Marmelstein/"},{"title":"Highly maintainable App Architecture - Aleksandar Vacić","text":"There are many contenders for the title of new shiny and best app architecture for iOS apps. Many of them are brought in by developers coming from different programming background - like Java, Ruby, Javascript etc. There are lots of terms flying around like: MVVM, Flux, Redux, RX, VIPER etc. With existing terminology of MVC, Delegate and Singleton patterns and Dependency Injection — it’s not hard to imagine that even senior developers might find themselves overwhelmed. Many of the newer architectures are actively trying to replace existing coding practices that Apple continues to actively promote to developers and is implementing them in new APIs on the platform. In this talk I want to present an approach that doesn‘t replace anything - it embraces and builds on top of existing iOS API patterns. I will use an example (open-source) live app that shows: what’s the correct way to use MVC how to efficiently use DI (Dependency Injection) to properly transfer input data/configuration throughout the apphow and when to use Delegate pattern where and how to use Coordinators to manage data flow and display VCs, with minimum amount of boilerplate code where do components like network and API wrappers fit into the app how to create single point of data source for any other component in the app how to persist data in such a way that you can easily replace all of it with something else (say switch from Core Data to Realm) Each of the components is loosely coupled with the rest, each component does not care about the rest of the app. This separation of concern leads to easier testing, simpler maintainance and large degree of freedom to change data flow or even completely replace certain parts. If the architecture must have a name, MVC-C-DNA would suffice. :) –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Highly-maintainable-App-Architecture-Aleksandar-Vacic/"},{"title":"How I Spent All My Savings Reinventing Programming - Luis Solano","text":"I’m sure you’ve had the same question too: what is “The Best Way™” of programming? Agile? TDD? Haskell? Pair programming? I believe the answer has nothing to do with that. I’ve spent the last two years thinking exclusively about this question and working towards a solution. Do silver bullets exist? Come find out. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-How-I-Spent-All-My-Savings-Reinventing-Programming-Luis-Solano/"},{"title":"How to get started contributing to open source projects - Felix Krause","text":"Felix will talk about why open source is crucial for our ecosystem, how it can benefit you, and how to get started contributing. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-How-to-get-started-contributing-to-open-source-projects-Felix-Krause/"},{"title":"Hyper fast app development with React Native - Fabio Pelosin","text":"The innovation which surrounds the React Native and the larger Javascript community is worth taking a look at. In this talk I’ll explore the speed of development which can be reached with React Native, the unexpected benefits of this stack, and how developing with it is in practice. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Hyper-fast-app-development-with-React-Native-Fabio-Pelosin/"},{"title":"Lightweight Markup Parsing - Guillermo Gonzalez","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Lightweight-Markup-Parsing-Guillermo-Gonzalez/"},{"title":"Measuring performance in production - Francisco Javier Fernández Toro","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Measuring-performance-in-production-Francisco-Javier-Fernandez-Toro/"},{"title":"Metaprogramming in Swift - Krzysztof Zabłocki","text":"Lets take a look at recently released Sourcery and how it can be applied in variety of different use-cases to make development more powerful and enjoyable, while at the same time limiting amount of human mistakes. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Metaprogramming-in-Swift-Krzysztof-Zablocki/"},{"title":"My Road to Damascus (or How I came to seriously consider Functional Reactive Programming) - Abizer Nasir","text":"I’m normally a vanilla programmer. I like classic programming paradigms, and people who know me will tell you that I’m not a fan of third partly libraries. But, I’m a contractor, and that means I need to be able to do things that I wouldn’t normally do Not only is FRP (RxSwift for the purposes of this talk) a large single dependency to add to a project, it also encourages a different programming style. I’ve spoken to people about FRP and I’ve been told that they see it as very abstract and can’t find simple examples of these differences (beyond the classic example of validating a username and password). This talk will try to correct that by providing a side by side comparison and people can make their own minds up about whether it is something that they want to incorporate into their own apps. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-My-Road-to-Damascus-or-How-I-came-to-seriously-consider-Functional-Reactive-Programming-Abizer-Nasir/"},{"title":"Real World Accessibility - Sommer Panage","text":"As an iOS developer working in accessibility at both largecompanies and small start-ups, I’ve come away with many anecdotes andlessons. In this talk, I’ll share three concrete stories about what itmeans to work on accessibility at real jobs. We will go beyond demo appsand sample code to discuss real issues, both in the technical andproduct development areas. The goal of this talk is to highlight some ofthe interesting challenges you might face in your own accessibility workas well as possible pathways forward. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Real-World-Accessibility-Sommer-Panage/"},{"title":"Start Where You Are Iterating at Scale - Kathy Tafel","text":"There’s lots and lots and lots of case studies and tutorials and SDKs and best practices that help you build and design systems from scratch. But not so many about iterating at scale. This talk covers building out a light weight system able to handle millions of consumers from client to server. What are the considerations of scale and the choices you have to make when you are already operating at a level where integrating other solutions is expensive? How do you manage negotiating features with your non-iOS engineer colleagues? How do you go determine MVP vs MaxVP? How do you measure success? –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Start-Where-You-Are-Iterating-at-Scale-Kathy-Tafel/"},{"title":"Stop Making Average Apps - Sally Shepard","text":"If you’re only ever thinking about the “average” user, you’re probably making an app for no one. Each user has different needs, so how do you create interfaces that are simple yet flexible? In this talk you’ll learn why Dynamic Type is important and how to support it in your apps. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Stop-Making-Average-Apps-Sally-Shepard/"},{"title":"Taming Animations - Sash Zats","text":"Animations set iOS apart from Android, they are signature garnish on top of every app recognized by Apple Design Awards. Over the years we accumulated many technologies allowing to build animations from simplest color changes to immersive experiences that make us praise the app on Twitter. But which one is the right for you? Are you sure you know all the options out there? Learn about many 1st and 3rd party frameworks, get to know their strong sides, be aware of their shortcomings. Get your definitive guide on animations! –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Taming-Animations-Sash-Zats/"},{"title":"Understanding code signing x509 and Apple - Marin Usalj","text":"Every iOS developer has hit the wall of trying to publish an iOS app. Code signing is one of the most hated topics in the field: it’s obscure, complicated and not well understood. The talk will clarify all the components in the code signing process, and show how they play together. It should save you some time in the future, or you get all your money back™! The talk will go over private keys, .p12 archives, certificates, CSRs, provisioning profiles, teams, and show some usages in practice. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Understanding-code-signing-x509-and-Apple-Marin-Usalj/"},{"title":"Why You Shouldn't Write Tests (Yes, We're Going There) - Dave Schukin","text":"The iOS development community is generally split into two factions when it comes to writing automated tests: Those that timidly don’t write tests, mostly due to the difficulty of doing so on iOS, but quietly recognize their value Those that vocally advocate for writing tests, and continuously build new tools &amp; frameworks for testing, as well as educate the rest of the community For the most part, those in group B are correct, as tested code is generally better code. (The title of this talk is intentionally misleading.) However, there are many scenarios in which writing tests can actually be detrimental to your app, to your team, to your launch, to your users, and to the success of your company. This talk will cover: A brief history of testing in iOS When &amp; why you should write tests When &amp; why you should skip writing tests: Building apps for pre-seed startups, building experimental features that will be rolled out to 1% of users, features that are almost entirely UI, and many other scenarios. A comparison of different team structures, application types, and in which of these testing is best skipped. This is intended to be a controversial yet educational talk, that is both technical &amp; humorous in nature. :) –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Why-You-Shouldn't-Write-Tests-Yes-We're-Going-There-Dave-Schukin/"},{"title":"A Better MVC - Dave DeLong","text":"Recent years have seen the adoption of patterns like MVVM, VIPER, DISCOVER, FRP, and React as an attempt to work around the apparently-intrinsic problems many developers face when using MVC. In this talk, we’ll explore the philosophy that underlies MVC, and how applying the principle of decomposition can solve these problems, while at the same time promoting reusability, testability, and making your codebase a pleasant and well-organized work of art. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-A-Better-MVC-Dave-DeLong/"},{"title":"Combinators - Daniel Steinberg","text":"Just as with OO, one of the keys to a functional style of programming is to write very small bits of functionality that can be combined to create powerful results. The glue that combines the small bits are called Combinators. In this talk we’ll motivate the topic with a look at Swift Sets before moving on to infinite sets, random number generators, parser combinators, and Peter Henderson’s Picture Language. Combinators allow you to provide APIs that are friendly to non-functional programmers. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Combinators-Daniel-Steinberg/"},{"title":"Building apps at scale - Pavel Mazurin & Victor Pena","text":"Slides: http://t.uber.com/nsspain2018 Most well known mobile architectures start to work against you after your engineering team grows large. A new architecture paradigm is needed to support the development of mobile applications with hundreds of mobile engineers. At Uber, we’ve been through this journey, growing from one mobile developer to hundreds. After investigating many other mobile architectures, we created RIBs: a platform-agnostic mobile architecture designed with reliability, testability, isolation and maintainability in mind. We re-wrote the Uber application in 4 months with 200 engineers. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Building-apps-at-scale-Pavel-Mazurin-and-Victor-Pena/"},{"title":"Avant-garde Programming Patterns - Benedikt Terhechte, Martin Kim Dung-Pham & Rich Barton","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Avant-garde-Programming-Patterns-Benedikt-Terhechte-Martin-Kim-Dung-Pham-and-Rich-Barton/"},{"title":"Avoiding culture shock. Designing apps for different cultures. - Daniel Munoz","text":"When we need to ship apps to different countries we usually only rely on localization. Sometimes it is not enough. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Avoiding-culture-shock.-Designing-apps-for-different-cultures.-Daniel-Munoz/"},{"title":"Embrace your Legacy… Code - Nelida Velazquez","text":"Working with legacy code can be challenging and sometimes a little frustrating. In this talk, I would like to explore the positive side of it and how it can help to grow your skills and become a better developer. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Embrace-your-Legacy...-Code-Nelida-Velazquez/"},{"title":"Embracing Change - Kristina Fox","text":"My team has gone through a lot of changes over the last year. We went from 6 iOS engineers to a merged team of 30 and is currently going through a redesign, language rewrite and re-architecture of our app. This talk would share some of our learnings from what went well and what didn’t go well throughout this journey. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Embracing-Change-Kristina-Fox/"},{"title":"Going Deep With Animations in iOS - Hector Matos","text":"–Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Going-Deep-With-Animations-in-iOS-Hector-Matos/"},{"title":"How To Control The World - Stephen Celis","text":"On a daily basis we work with APIs that interact with the outside world. These APIs can be inconsistent, unreliable, or fail. As we sprinkle calls to these APIs throughout our applications, we often make our own code more difficult to work with, test, and be confidence in. This talk covers a simple, effective solution to taking control of the outside world, improving the way we work with our code in dramatic ways. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-How-To-Control-The-World-Stephen-Celis/"},{"title":"From Engineer to Manager A personal journey - Marcus Wermuth","text":"This talk is a story - a story of how I went from being a senior iOS/Android Developer to a Manager. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-From-Engineer-to-Manager-A-personal-journey-Marcus-Wermuth/"},{"title":"React Native Unfiltered Insights from Introducing React Native to a Production Application - Isabel Barrera","text":"Is your team considering introducing React Native into an existing production application? This talk will focus on some of the challenges of taking a hybrid approach to React Native, including hybrid feature architecture, performance, and team dynamics. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-React-Native-Unfiltered-Insights-from-Introducing-React-Native-to-a-Production-Application-Isabel-Barrera/"},{"title":"Scaling up mobile at ING - Bart den Hollander","text":"Want to know how a large banking app as ING creates maintainable iOS frameworks that will be used by multiple countries? I’ll share all insights about what it takes to scale up a large codebase, how to maintain it and the lessons learned. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Scaling-up-mobile-at-ING-Bart-den-Hollander/"},{"title":"Siri Shortcuts - Ellen Shapiro","text":"–Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Siri-Shortcuts-Ellen-Shapiro/"},{"title":"Solving callback hell with good old function composition - Vincent Pradeilles","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Solving-callback-hell-with-good-old-function-composition-Vincent-Pradeilles/"},{"title":"Stacktrace Live Podcast - John Sundell & Guilherme Rambo","text":"https://stacktracepodcast.fm –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Stacktrace-Live-Podcast-John-Sundell-and-Guilherme-Rambo/"},{"title":"Strings Seven Ways - Mattt","text":"(Note: Unfortunately, there were technical problems when recording this talk, as a result it has poor audio quality and some footage of the beginning is missing. But it’s still an amazing presentation that’s worth sharing. Thanks for bearing with us, we hope you enjoy it) Strings are the most versatile type in the Swift standard library. This talk looks at seven different ways to understand and work with strings: as collections of Unicode characters, as identifiers, as paths, as natural language text, as encoded data, as structured data, and as typographic content. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Strings-Seven-Ways-Mattt/"},{"title":"Synthesizing Synths in Swift - Adam Bell","text":"iOS is a fantastic platform for building musical instruments, so let’s learn some audio theory and make some synthesizers in Swift! –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Synthesizing-Synths-in-Swift-Adam-Bell/"},{"title":"Teaching Swift at Scale - Paul Hudson","text":"Each year, one million users visit the Hacking with Swift website to learn something new about Swift, iOS, and more. In this talk I’ll walk you through the main problems people hit, what that tells us about the state of Swift development, and how trends have changed over time. More specifically, I’ll cover how people are keeping up with changes to the language, which APIs continue to be most problematic, and how our community is slowly drifting apart on architectures. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Teaching-Swift-at-Scale-Paul-Hudson/"},{"title":"The Art of Spelunking - Guilherme Rambo","text":"The talk will start with an overview of what reverse engineering is, what you can achieve with it and what are the basic tools used. I’ll then dive into a practical demo of how I used that knowledge to find references to unreleased features on HomePod by hacking the iOS Simulator. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-The-Art-of-Spelunking-Guilherme-Rambo/"},{"title":"Thoughts on Vapor - Pier Cifani","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Thoughts-on-Vapor-Pier-Cifani/"},{"title":"UI Testing Infrastructure in Avito - Vladislav Alexeev","text":"We rely on UI testing heavily: we now have more than 500 e2e tests that we need to run and maintain. The perfect infrastructure is a key of the success. I cover what we use for testing, what problems we’ve met and how we solve them. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-UI-Testing-Infrastructure-in-Avito-Vladislav-Alexeev/"},{"title":"Unit Testing UIViewControllers - Parveen Kaler","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Unit-Testing-UIViewControllers-Parveen-Kaler/"}],"tags":[{"name":"2014","slug":"2014","link":"/tags/2014/"},{"name":"2015","slug":"2015","link":"/tags/2015/"},{"name":"2017","slug":"2017","link":"/tags/2017/"},{"name":"2018","slug":"2018","link":"/tags/2018/"}],"categories":[{"name":"NSSpain","slug":"NSSpain","link":"/categories/NSSpain/"}]}