{"pages":[],"posts":[{"title":"ADDC 2018 - Bob Byrne Sponsored talk - Vector meets Pixel Affinity Designer","text":"Bob will show you how he uses Affinity Designer to both prototype rapidly and create production-ready assets for Apps and Games. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/vector-meets-pixel-affinity-designer/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Bob-Byrne-Sponsored-talk-Vector-meets-Pixel-Affinity-Designer/"},{"title":"ADDC 2018 - Cristina Santamarina Humans vs Bots Typos, Trolls and other challenges for NLP","text":"Humans vs Bots explores the technical limitations of NLP in a world of high expectations. A mix of faster computers, a more mature artificial intelligence field and the growing collaboration of technologists and humanists is shaping the new generation of conversational interfaces. How much magic is there really involved and where are we in the practice? How are real chatbots from real brands performing? In this talk Cristina Santamarina will review the 10 most important natural language challenges she faces when designing conversational interfaces. From slang and typos to rants and trolls she will provide examples and propose dialogue design techniques that can help mitigate them. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/humans-vs-bots-typos-trolls-and-other-challenges-for-nlp/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Cristina-Santamarina-Humans-vs-Bots-Typos-Trolls-and-other-challenges-for-NLP/"},{"title":"ADDC 2018 - Dan Miller Design For Stigma","text":"How might we design products and services for populations in which stigma is inherently part of their experience? In this talk, we will explore design and research methodologies to begin answering this question. Understanding how to address this problem will enable us to create solutions for some of the largest challenges humans face today - in healthcare, finance, government, etc. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/design-for-stigma/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Dan-Miller-Design-For-Stigma/"},{"title":"ADDC 2018 - Devant, Basha Augmented Reality, design to development","text":"Over the last couple of years there’s been significant advancement in the technology of Augmented Reality (AR), allowing it to become the next big thing in human-computer interaction. Giants like Apple and Google have now created their own AR frameworks and released them to developers, providing the foundations of this technology, allowing us to easily innovate and solve problems with it.. In this talk, we will go over the fundamentals of building an AR app, both with using Google’s ARCore and Apple’s ARKit, as well as some basic guidelines on designing accurate and realistic 3D objects, which will augment our real world. The session will include a demo app with ARKit and ARCore to showcase how AR translates into code, as well as using 3D design software to create models, set up the scene with lights and shadows, and even animations. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/augmented-reality-from-design-to-development/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Devant-Basha-Augmented-Reality-design-to-development/"},{"title":"ADDC 2018 - Dori Adar What can we learn from games on UX and user behaviour","text":"We push buttons to play games. In return, they push ours. In this talk I’ll discuss five lessons learned on the relationship between games, digital products and humans. Through vivid examples I will provide key takeaways from the gaming world to apply in almost every digital product design. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/what-can-we-learn-from-games-on-ux-and-user-behaviour/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Dori-Adar-What-can-we-learn-from-games-on-UX-and-user-behaviour/"},{"title":"ADDC 2018 - Eli Ganim Facebook Lite Building for Emerging Markets","text":"Emerging markets will account for over 90% of new mobile subscribers globally by 2020. If you’re not currently building your products with these users in mind then you’re missing out on a huge growth lever. In this talk Eli will describe the characteristics of these markets, the challenges his team faced when building Facebook Lite and their biggest wins. You’ll hear about common assumptions that don’t hold in emerging markets and some dos and don’ts. More about the talk, authors &amp; slides:https://addconf.com/2018/schedule/facebook-lite-building-for-emerging-markets/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Eli-Ganim-Facebook-Lite-Building-for-Emerging-Markets/"},{"title":"ADDC 2018 - John Sundell Prototype Everything","text":"Prototyping is a great tool when it comes to quickly validating an idea or a new concept. It can let us try out a new UI design, an experimental way of coding or even an entire app. But prototyping can also be used in so many more situations, and can really help teams move a lot quicker without sacrificing the quality of their product. In this talk, John will share his experiences working with prototyping in many different contexts, and show how you can really prototype everything. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/prototype-everything/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-John-Sundell-Prototype-Everything/"},{"title":"ADDC 2018 Jolanda Verhoef - Apps can have design systems too!","text":"How do you maintain a consistent design for your native apps? This talk will present a solution for creating a living design system on mobile platforms. You’ll walk away with the knowledge to start your own design system journey! More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/apps-can-have-design-systems-too!/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Jolanda-Verhoef-Apps-can-have-design-systems-too!/"},{"title":"ADDC 2018 - Mike Lazer So THAT'S how your phone knows where you are!","text":"Users increasingly demand apps that are location-aware, but working with location services can be frustrating. Accuracy can vary wildly, and users complain loudly if your app destroys their battery. Even worse, location services APIs often feel like black boxes, leaving even experienced developers scratching their heads how to debug them. So how does it all actually work? How can your phone, solely using the position of a few satellites, figure out where you are to within a few meters? How, dare we ask, is the location technology sitting in our pockets indebted not only to the Cold War but to the navigational needs of 18th century sailors? We’ll explore the underlying technology behind GPS and location services, helping you better understand why things fail when they do, and how you can best design around the limitations of the technology. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/so-thats-how-your-phone-knows-where-you-are!/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Mike-Lazer-So-THAT'S-how-your-phone-knows-where-you-are!/"},{"title":"ADDC 2018 - Renata Schwegler App Design for Women, by Women","text":"Enough with clichés and pink stereotypes for female products. Let’s demystify stereotypes and assumptions. Needs that woman didn’t even have were once created by man working in brands targeting female audience. This talk will show how - and how not - branding and design should be tought for women-centric products. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/app-design-for-women-by-women/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Renata-Schwegler-App-Design-for-Women-by-Women/"},{"title":"ADDC 2018 - Sara Cambridge Designer/developer collaboration what works and what doesn’t","text":"What does effective designer/developer collaboration look like? Having interviewed a wide range of designers and developers about their collaboration process, Sara has uncovered many insights into what works and what doesn’t. She will also explain how and why better products get made when all those involved in building them attend research. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/designer-developer-collaboration-what-works-and-what-doesnt/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Sara-Cambridge-Designerdeveloper-collaboration-what-works-and-what-doesnt/"},{"title":"ADDC 2018 - Tracy Osborn You Built an App! Now How to Get It Seen and Used","text":"Marketing is tough but crucial. It sucks when you build something awesome but no one uses it. How do you get the word out? How do you find users? This talk will go over marketing in general and what developers can do to make sure they market their apps without taking up too much of their time (or feeling too smarmy) More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/how-to-get-it-seen-and-used/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Tracy-Osborn-You-Built-an-App!-Now-How-to-Get-It-Seen-and-Used/"},{"title":"ADDC 2018 - Tobias Due Munk Into the Deep – the depth sensing technology","text":"Mobile has always been driven forward by a plentitude of sensors like GPS, motion, and camera. With the advent of depth sensing technologies new possibilities open up for apps. Watch and learn intricate details and loads of use cases through an immersive and interactive talk packed with 80s visuals and audio. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/into-the-deep/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Tobias-Due-Munk-Into-the-Deep-the-depth-sensing-technology/"},{"title":"ADDC 2018 - Ty Smith Building for Developers","text":"Many teams are designed so that engineers can take an abstract view of the customer and focus on implementation. But when the customers are other engineers, that entire dynamic is thrown on it’s head. In this talk, Ty will walk you through the best practices of building great products for developers, from team processes to the technical delivery. Topics covered will include: Building customer personas and product strategies, Developer Experience research and analytics, customer empathy and support structures, API Design and usability, testing, code distribution, and creating great documentation. More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/building-for-developers/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Ty-Smith-Building-for-Developers/"},{"title":"ADDC 2018 - Viktor Persson \"Remote Control\"","text":"The world is smaller than ever and more often teams are never in the same room together. Naturally this has changed how we get things done. It’s time to talk about what works and what doesn’t when we are working remotely. How does this change what is required and expected from each and everyone of us? More about the talk, authors &amp; slides: https://addconf.com/2018/schedule/remote-control/Read about the conference: https://addconf.com","link":"/ADDC/2018/ADDC-2018-ADDC-2018-Viktor-Persson-Remote-Control/"},{"title":"ADDC - App Design & Development Conference 2018","text":"App designers and developers around the world work side by side every day to build some of the most incredible and innovative applications. Yet our potential for synergy is so often overlooked.ADDC aims to create an opportunity for designers and developers to meet, find new ways to work together and get inspired in an open, inclusive and collaborative space. ADDC 2018 was held 4-6 July, 2018, in Barcelona, Spain. https://addconf.com/","link":"/ADDC/2018/ADDC-2018-ADDC-App-Design-and-Development-Conference-2018/"},{"title":"NSSpain 2013 \"Foldify - history of development and lessons learned\" by Krzysztof Zabłocki","text":"","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2013-Foldify-history-of-development-and-lessons-learned-by-Krzysztof-Zablocki/"},{"title":"NSSpain 2014 \"Autolayout for everyone\" by Krzysztof Kucharewicz","text":"IntroductionForget about frames, forget about multiple nibs for each view controller. Autolayouts are here to solve complex relations between UI objects and make a robust UI that will hopefully require less maintenance with the introduction of new device form factors.MotivationAutolayouts first appeared in iOS 6 and XCode 4.6. They constituted a big change in interface design. A complex set of rules was introduced for UI implementation. Let’s be honest, this was not a good start since Interface Builder at the beginning was trying to be smarter than the developer and was modifying the designs in an often unwanted way.The programatically applied interfaces have been introduced as the alternative to IB, but the NSLayoutConstraint’s lengthy method constraintWithItem: scares many programmers and the ASCII­art from constraintsWithVisualFormat: gives a headache at the first glance.The issues with IB are pretty much in the past. It’s now way easier to create desired constraints and debug them in the XCode 5.0+. Open source programmers have not been lagging behind and we can now find libraries helping with the interface design in code.During my daily work I can see that the Autolayout is being more and more used in the interface design, but when it comes to dynamic changes in the interface (and animations in particular) many programmers revert to the “comfort zone” of pixels and frames. All that can obviously be done using autolayouts, easier than you might have thought.The TalkI’ll show how to create layouts that adjust to both iPhone and iPad design and respond adequately to the changing content.I’ll present how to interpret and fix warnings and errors that are presented in the Interface Builder. I’ll show when and how to create and manipulate autolayout constraints in code and create fun animations.I’ll introduce the Lyt library (https://github.com/robotmedia/Lyt).As an addition I’ll also introduce the NibWrapper library for modular interface design that plays very well with Autolayouts (https://github.com/mobilejazz/NibWrapper). +info: https://github.com/mobiosis/NSSpain-autolayout-test","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Autolayout-for-everyone-by-Krzysztof-Kucharewicz/"},{"title":"NSSpain 2014 Interview with Ash Furrow","text":"NSSpain Interview: Ash Furrow talks about Swift and his upcoming book.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Ash-Furrow/"},{"title":"NSSpain 2014 \"Can't handle my scale\" by Michele Titolo","text":"Scaling an app means many things. They can be human things, like “how do I stop someone from overwriting my changes to the project.pbxproj, storyboard, or xib?” Or development things, like “how do I manage dependencies?” and “why do I always have to do a 3-way merge?” Or even peripheral things like “what happens to our servers if we get featured?” and “what happens to the app when the servers go down?” This session will cover common scaling problems, and solutions to overcome them.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Can't-handle-my-scale-by-Michele-Titolo/"},{"title":"NSSpain 2014 Interview with Orta Therox","text":"Stefan Völker talks with Orta Therox about his “A Swift Start”","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Orta-Therox/"},{"title":"NSSpain 2014 Interview with Enric Enrich and Jaime Paulo","text":"NSSpain Interview: Enric Enrich and Jaime Paulo","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Interview-with-Enric-Enrich-and-Jaime-Paulo/"},{"title":"NSSpain 2014 \"Swift and C\" by Mike Ash","text":"Swift provides rich facilities for OO and functional programming, but it also allows extensive bridging to C APIs. Learn all about how to call C functions, work with “unsafe” pointers, manage memory, and more.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-Swift-and-C-by-Mike-Ash/"},{"title":"NSSpain 2014 \"What to do when you get hacked ?\" by Andrew Yates","text":"As you may know Buffer got hacked last October. They gained access to access tokens through our database and then used them to start posting out to the users Twitter and Facebook accounts. Not many companies or people are very open about what happens when they get hacked. Keeping things very secretive before sending out a mass email to everyone days or even weeks after first discovering the issue. Buffer is transparent about a lot of things from salaries to how much money is in the bank so we hit the breach head on. I will talk more about the iOS side of things. The expedited reviews and the changes we put in place within the app after.","link":"/NSSpain/2014/NSSpain-2014-NSSpain-2014-What-to-do-when-you-get-hacked-by-Andrew-Yates/"},{"title":"All the [tech] world's a stage - Michele Titolo","text":"Creativity, collaboration, and ever-more-complex technology. While we like to think these characteristics are unique to software development, they’ve defined the theatrical arts for centuries. Putting on a show requires teamwork, accountability, problem solving, and disaster recovery, all within strict time and resource constraints. Sound familiar? This session will explore history, art, communication, and how to build something that brings delight to all who see it. Michele TitoloNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-All-the-tech-world's-a-stage-Michele-Titolo/"},{"title":"Bringing CocoaPods to Linux - Boris Bügling","text":"With Swift coming to Linux, it was clear that we also wanted to be there with CocoaPods, ideally offering a solution for managing dependencies of Swift projects on Linux as early as possible. The main major challenge of this is CocoaPods’ historic entanglement with Xcode, a topic which we wanted to resolve for other reasons already (see https://github.com/CocoaPods/CocoaPods/issues/2729). In this talk, we’ll learn a lot about Xcode’s build system and how we are replacing it with a more direct connection to the build toolchain to break our dependance on Xcode. This talk will also discuss two alternatives to using Xcode as the build system, GNU Makefiles and Facebook’s Buck, considering the pros and cons. Boris BüglingNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Bringing-CocoaPods-to-Linux-Boris-Bugling/"},{"title":"Best Of NSSpain 2014","text":"Have a brief look why NSSpain was one of THE events in 2014! If you’re interested in coming this year, take a look at our website! There you can find our current (and incredible!) line up of speakers, and all the info about the event! -&gt; http://nsspain.com/","link":"/NSSpain/2015/NSSpain-2015-Best-Of-NSSpain-2014/"},{"title":"DevOps in the iOS world - Piet Brauer","text":"Mobile application development has many different facets, from independent developers to teams of 50 developers working on the same code base. While other developer groups, e.g. web application had scaling problems in the past and came up with solutions like DevOps, Mobile application development is stuck in the past. This talk is to explore DevOps techniques like Continuous Integration, Continuous deployment and more in the iOS domain.I worked for small agencies, big companies and helped scaling teams and development processes from 1-2 people to 16 people spread across Europe. I recently started a blog series about this very topic over here: http://nerdishbynature.com/post/2015/05/28/devops-introduction.html Piet BrauerNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-DevOps-in-the-iOS-world-Piet-Brauer/"},{"title":"Digging Deeper Understanding HTTP - Daniel Eggert","text":"This talk is focusses on how TCP/IP and HTTP play together to help make good decisions that can dramatically improve the performance for network intensive apps. The talk is based on my article “IP, TCP, and HTTP” http://www.objc.io/issues/10-syncing-data/ip-tcp-http/ but also steps into the territory of SPDY and HTTP/2 to talk about how these help network performance. Broad outline: IP — The Internet ProtocolWhat does it do? Packets and routing. TCP - Reliable StreamsTurning best-effort into reliableHow does a TCP connection work?Connection setup, data flow, and congestion control HTTP/1.1The lingua france of the internet“Request and Response” patternThe challenges of HTTP/1.1 -&gt; verbose, connection re-use, … HTTP/2The internet has evolved.Which problems does HTTP/2 solve?How to use HTTP/2 efficiently? Daniel EggertNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Digging-Deeper-Understanding-HTTP-Daniel-Eggert/"},{"title":"Empathy coding innocent - Hermes Pique","text":"We strive to make our apps surprise and delight users. Sometimes it’s about spending hours tweaking an animation to make it pop. And sometimes it’s about closing our eyes and using our app with VoiceOver on. I’d like to share with you my experience making apps accessible at Facebook. Hermes PiqueNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Empathy-coding-innocent-Hermes-Pique/"},{"title":"Diving Into HomeKit - Taylan Pince","text":"This talk will cover the basics of building a HomeKit driven app as well as an Arduino based hardware prototype that you can control via the iOS app. My aim is to give a solid introduction to hardware prototyping while also focusing on one of Apple’s hottest new frameworks. We will step through how to approach a custom built light control and door buzzer system while integrating them with remote controls via Siri. Taylan PinceNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Diving-Into-HomeKit-Taylan-Pince/"},{"title":"Functions, a love affair - Josh Abernathy","text":"Big, complex things are made out of many little, simple things—or least they should be. Simple things are easier to write, easier to debug, and easier to change. Functions are beautifully simple. Composing them lets us make big things out of small things. By thinking differently about app architecture, we can start to build our apps out of smaller, simpler things. Josh AbernathyNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Functions-a-love-affair-Josh-Abernathy/"},{"title":"Getting Ahead of the Curve - Adam Bell","text":"A deep-dive into how awesome prototyping can be when you’re playing with unreleased features that you’ve reverse engineered… all the while beatings others to the punch. Adam BellNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Getting-Ahead-of-the-Curve-Adam-Bell/"},{"title":"Going swiftly to a Functional world - Ana Márquez & Javier de Silóniz","text":"Introducing Second Bridge: a Swift framework that introduces several new functional concepts to the language with a Scala-like syntax. We’ll present to the guests new data types that come from the Scala/Haskell world, and new patterns that can make your programming better. Ana Márquez &amp; Javier de SilónizNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Going-swiftly-to-a-Functional-world-Ana-Marquez-and-Javier-de-Siloniz/"},{"title":"Hardware-assisted debugging - Philippe Casgrain","text":"Reproducing a bug can sometimes be tricky, especially if you have to type a lot or move the mouse. And sometimes you can’t use Automator or other scripting engines because you suspect that may just hide the bug. With the help of an Arduino board, Philippe will show you how to cheaply emulate a USB keyboard and mouse with randomized or predictive inputs so you can do something more productive than repetitive typing. This presentation will contain a minimal amount of code and a live demo. Philippe CasgrainNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Hardware-assisted-debugging-Philippe-Casgrain/"},{"title":"Humanities X Technology - Ashley Nelson-Hornstein","text":"What does it mean to approach software and hiring with the perspective of Steve Jobs, that its “Apple’s DNA that technology alone is not enough - it’s technology married with liberal arts, married with the humanities, that yields us the results that make our heart sing?” Ashley Nelson-HornsteinNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Humanities-X-Technology-Ashley-Nelson-Hornstein/"},{"title":"Indie Rock and Roll - Airplane Mode","text":"In addition to being an indie rock band, Dave Wiskus and Joe Cieplinski are also designers, businessmen, and veterans of the Apple development community. They’ll talk about how their approach to art affected their technical work, and how their experience designing for iOS and working in a community that fosters an independent spirit has enabled them to make money as musicians. Airplane ModeNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Indie-Rock-and-Roll-Airplane-Mode/"},{"title":"Intelligent UI with AsyncDisplayKit 2.0 - Scott Goodson","text":"Intelligent UI with AsyncDisplayKit 2.0 Scott GoodsonNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Intelligent-UI-with-AsyncDisplayKit-2.0-Scott-Goodson/"},{"title":"Learn, Compete and Win. An introduction to Topcoder - Charlie Cowan","text":"In this session learn how to up your iOS app dev skills, win cash prizes, and compete in our iOS community. On topcoder you can prove your iOS skills by earning our iOS topcoder badges and gain exclusive access to iOS challenges, as well as special community-related events and info, all while being paid to build real world enterprise iOS apps! Charlie CowanNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Learn-Compete-and-Win.-An-introduction-to-Topcoder-Charlie-Cowan/"},{"title":"Let’s Play Refactor the Mega-Controller - Andy Matuschak","text":"So you’ve got this huge view controller that knows about everything, and it’s become some kind of puppeteer mastermind whose responsibilities have somehow grown to simultaneously encompass disk I/O and navigation bar styling. You’re supposed to change its behavior significantly, but you have zero confidence that you can do this without breaking the world. Together, we’ll refactor a tangled view controller, unit test it without tons of stubbing goo, and make it easier to change over time. We’ll use general strategies that you can deploy without coming off as some kind of high-falutin’ academic. Andy MatuschakNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Lets-Play-Refactor-the-Mega-Controller-Andy-Matuschak/"},{"title":"Making Sense of Xcode - Grant Paul","text":"Tips and tricks to understand how Xcode works, so you’ll never (hopefully) see a broken build again. Grant PaulNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Making-Sense-of-Xcode-Grant-Paul/"},{"title":"Learning security by being smiling_imp - Daniel Haight","text":"We’ll learn about levels of security on the iOS and OS X platforms by a series of Sneaky Hacks™. The talk will be a set of demos that will demonstrate vulnerabilities increasing in severity and difficulty as well as how to avoid them happening to you or the apps you build. Most of the content will be relevant and actionable to anyone creating iOS apps. Anything that isn’t will be super entertaining 😸. Things that will be covered: 1) Get the user to download an app: We’ll write an app that can steal keychain credentials We’ll patch a version of an app the user already has (e.g. Twitter) to dump secure data. 2) Access a network the user is on: Intercept some network traffic from an app that isn’t our own 3) Get root access: Attach debugserver to app, use LLDB on a 3rd party app/ Tweek 3rd party apps (make all twitter photos cats) Tweek system (OS processes). Draw something on the lock screen. Access to 3rd party apps’ data (passwords/tokens etc). Set up remote access (for next demo) 4) Get remote access: A real time mitm server dumping all network traffic. Daniel HaightNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Learning-security-by-being-smiling_imp-Daniel-Haight/"},{"title":"Mobile Continuous Integration at SoundCloud - Vincent Garrigues","text":"In the past two years at SoundCloud, we’ve shipped a brand new iPhone and iPad app and completely transformed the way we work. The team scaled from 3 to 10 developers, we’ve moved away from pull-requests and rely heavily on automated testing. As SoundCloud grew, its backend infrastructure got more complex with the addition of many microservices. Ensuring our apps to work with these microservices in production is key to SoundCloud’s continuing success. That’s why we’re building custom continuous integration solutions for our mobile apps. Vincent GarriguesNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Mobile-Continuous-Integration-at-SoundCloud-Vincent-Garrigues/"},{"title":"Poor man's functional programming - Miguel Quiñones","text":"Getting started with new paradigms requires us to change thinking and make mistakes along the way. Functional programming from the eyes of a beginner, along with practical steps to gradually change how we write our code. Miguel QuiñonesNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Poor-man's-functional-programming-Miguel-Quinones/"},{"title":"Presenting Coordinators - Soroush Khanlou","text":"In my talk, I’ll present coordinators, which are a novel way to manage view controllers, enable re-use, and generally provide structure to code. Coordinators are objects that control flow in an app. Coordinators are typically initialized with a navigation controller, although they can manage other types of view controllers as well. View controllers are totally transparent to coordinators; view controllers display data as directed by their coordinator and bubble up events as delegate methods, which the coordinators respond to. This makes reusing view controllers completely trivial, since the view controller doesn’t bring any baggage along with it. Much like views and view controllers, coordinators are found in a tree structure. The root coordinator is called the app coordinator, and contains the code for setting up the root view controller, which you might typically find in an app delegate. Swapping out app coordinators could change your app from an iPad layout to an iPhone layout. When a coordinator begins doing too many tasks, those tasks can be pushed down into a child coordinator. Complexity can easily be managed, and it has space for growth. The using the coordinator model is a simpler way of managing iOS apps and is a great tool for slimming down large view controllers. Soroush KhanlouNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Presenting-Coordinators-Soroush-Khanlou/"},{"title":"The Zen Guide to WatchOS 2 - Natasha Murashev","text":"At WWDC15, WatchKit got a HUGE upgrade. Hello WatchOS 2! Learn the ins and outs of how the iOS and Watch App should work together to make the best user experience on the Apple Watch for your app. Natasha MurashevNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-The-Zen-Guide-to-WatchOS-2-Natasha-Murashev/"},{"title":"Team Leadership Lessons Learned The Hard Way - Michael May","text":"Over the past few years I have led a number of iOS teams, at various different companies in London, from digital agencies to large publishing houses. As you might expect we’ve enjoyed a lot of highs, and more than a few lows. In this talk I want to reflect on some of the lows, and my part in them. When the best of intentions goes awry, and you find yourself needing to be the best team lead you can be, what should you do first? How can you turn a toxic situation into a team building one? When teams turn on themselves, how do you pull it back? And when you’ve had an argument with another team mate that was so aggressive that your CTO had to step in, how do you end up calling that same developer a close friend? Naming no names but my own, I plan to tell you some of the challenges I’ve faced, what I did next and what I learned along the way so that, maybe, you don’t have to walk the same road too. Michael MayNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Team-Leadership-Lessons-Learned-The-Hard-Way-Michael-May/"},{"title":"Welcome - NSSpain","text":"Luis Ascorbe &amp; Borja ReinaresNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Welcome-NSSpain/"},{"title":"While Your App was Sleeping - Panel Discussion","text":"In our increasingly international market, internet speeds are not created equal, so having an immediately responsive and up to date app is essential. With the recent introduction of Background Transfer Service and Background Fetch, iOS apps can perform networking requests in the background. Whether it’s downloading assets, uploading large files, opening your app with fresh data, or getting data to your watch app, this new user experience is incredibly powerful. This panel will cover how different companies are leveraging this framework, architectures for the networking stack, and how to navigate development speed bump. Gwendolyn Weston Natasha Murashev Boris Bügling Michele TitoloNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-While-Your-App-was-Sleeping-Panel-Discussion/"},{"title":"Building Buddybuild - Dennis Pilarinos","text":"Building iOS apps is difficult enough, without having to worry about building your build system as well. Dennis and a couple of friends, while building an iOS app themselves, grew so frustrated that with existing developer tools, they decided to put the app on hold and build a better platform for all mobile developers. Today, buddybuild helps thousands of development teams, build &amp; test their code, deploy their apps, collect feedback and crash reports from their users - all with very little setup and maintenance. Dennis will tell the story of how buddybuild was created, and share some of the best practices he’s learned from thousands of development teams. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Building-Buddybuild-Dennis-Pilarinos/"},{"title":"Asymmetric Cryptography Between iOS and the Rest of the World - Ignacio Nieto","text":"Apple deprecated and then discontinued OpenSSL for its platforms and OS some years ago, leaving us with access to cryptography only through the Security framework. Unless, of course, you want to do some nasty hacks with custom built openssl libraries. Unfortunately, the Security framework is not well documented, isn’t specially developer friendly, and has not been thought to interact with 3rd parties, such as external servers making use of standard public key infrastructures and libraries such as OpenSSL. However, nowadays, it’s a common requisite for our apps to interact with secure backends and RESTful APIs making use of asymmetric cryptography, KPIs or public key systems. In this presentation, I will explain how to make your iOS application interact with these external public key infrastructures, importing keys from external entities (probably generated via OpenSSL) and exporting the keys generated at the device so they can be used in signature and verification operations externally. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Asymmetric-Cryptography-Between-iOS-and-the-Rest-of-the-World-Ignacio-Nieto/"},{"title":"“Why Swift?” for everyone else and so much more - Ayaka Nonaka","text":"The Venmo iOS team has spent the past 8 weeks rewriting our entire app (full of crufty old code dating back to 2011) in Swift. There were a lot of great things that we got out of this, but one of the biggest questions that we get is “That’s awesome, but how do I convince the rest of my team/company/stakeholders that it’s worth it?” This talk will cover subtle techniques and pitfalls to avoid to get what you want and how to apply it to other situations like giving code review feedback and working as a team in general. Ayaka NonakaNSSpain 2015","link":"/NSSpain/2015/NSSpain-2015-Why-Swift-for-everyone-else-and-so-much-more-Ayaka-Nonaka/"},{"title":"Building an IDE for iOS - Mark Villacampa","text":"On iOS 11, iPads are becoming much more useful productivity and content creation tools. With Apple’s push for Playgrounds.app and more permissive AppStore rules towards developer tools, it’s clear Apple wants us to write code on iOS. But is this all that’s needed to have world class IDEs for iOS? We’ll start with a walkthrough of the history and state of the art of iOS IDEs and related developer tools (developer-friendly text editors, git clients, terminal emulators, etc.). You’ll learn how Playgrounds.app works and what special rules it takes advantage of. We’ll go through the AppStore rules for developer tools, and what changed recently to allow more powerful IDEs. We’ll imagine how an IDE could look like on a multitouch device with new UIs and interactions, and what iOS 11 features we can leverage. A key feature of an IDE is executing code. We’ll learn how this is possible on iOS, its limitations, and the difference between interpreted, JITed and compiled execution. We’ll figure out what needs to change before we can have true desktop-grade IDEs on our iOS devices and put together an iOS 12 feature wishlist. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Building-an-IDE-for-iOS-Mark-Villacampa/"},{"title":"Code snippets for Debugging - Carola Nitz","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Code-snippets-for-Debugging-Carola-Nitz/"},{"title":"Dynamic Mocks in Swift - Victor Pimentel","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Dynamic-Mocks-in-Swift-Victor-Pimentel/"},{"title":"Creating a Computer Vision Machine Learning App From The Ground Up - Jorge Molina & George Karavias","text":"Core ML, Apple’s new foundational machine learning framework, is blazingly fast not to mention dead easy to incorporate in an app. To top that off Core ML boasts support for a broad variety of machine learning model types and provides a Python package to convert them. But how do you actually create and train a model to begin with? Join us as we go step by step through the whole process:Acquiring training dataCreating, training and optimising the modelConverting the model to Core ML and integrating itWiring Core ML to the Vision frameworkTo create a computer vision machine learning app. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Creating-a-Computer-Vision-Machine-Learning-App-From-The-Ground-Up-Jorge-Molina-and-George-Karavias/"},{"title":"Disassembly for Fun and Profit - Alexsander Akers","text":"Apple’s system frameworks make a lot of functionality available to us developers, from auto layout to calendrical calculations, locales, and formatting. Although the internal workings of these classes are not available to us, some implementation details are actually open source: auto layout is built on the Cassowary project, while NSCalendar, NSLocale, and the NSFormatter subclasses are built on top of the icucore framework. But because these projects are open-source, there’s nothing stopping us from seeing how they work under the hood. However, Apple does keep some goodies to themselves (persistent Touch Bar items) and some system functionalities are only available through opaque mechanisms (AirDrop through UIActivityController). In this talk I detail how to search for hidden functionality, the wonders of disassembly and decompilation, and how to follow the code trails through to the methods you want. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Disassembly-for-Fun-and-Profit-Alexsander-Akers/"},{"title":"Effective Remote Communication - Peter Steinberger","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Effective-Remote-Communication-Peter-Steinberger/"},{"title":"Everyone is an API designer - John Sundell","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Everyone-is-an-API-designer-John-Sundell/"},{"title":"Gems of GameplayKit - Tobias Due Munk","text":"GameplayKit might seem to be all about games, but it contains valuable gems that are perfect to be used in regular apps. Some of the things you can use from GameplayKit in a non-game are: ‘QuadTree’ for clustered of annotations on zoomable views, just like MapKit does in iOS 11. ‘Procedural Noise’ for natural random animations ‘Perceptual Randomization’ for better™ shuffled playlists …or, why Steve Jobs said “We’re making it less, to make it feel more random”. Non-uniform randomness like Gaussian, when uniform random just isn’t suitable. ‘R-Tree’ for performant rubber band selection like MindNode uses for the CALayer backed view hierarchy. ‘Pathfinding’ for step by step navigation in indoor museums. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Gems-of-GameplayKit-Tobias-Due-Munk/"},{"title":"Facing the VIPER - Esteban Torres","text":"–Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Facing-the-VIPER-Esteban-Torres/"},{"title":"Growing - Roy Marmelstein","text":"Scale changes everything. In this talk I will share learnings from my experiences of working on projects of varying sizes. We will discuss iOS development when scaling teams on products with a growing user base and a growing codebase and the kind of problems you encounter along the way. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Growing-Roy-Marmelstein/"},{"title":"Highly maintainable App Architecture - Aleksandar Vacić","text":"There are many contenders for the title of new shiny and best app architecture for iOS apps. Many of them are brought in by developers coming from different programming background - like Java, Ruby, Javascript etc. There are lots of terms flying around like: MVVM, Flux, Redux, RX, VIPER etc. With existing terminology of MVC, Delegate and Singleton patterns and Dependency Injection — it’s not hard to imagine that even senior developers might find themselves overwhelmed. Many of the newer architectures are actively trying to replace existing coding practices that Apple continues to actively promote to developers and is implementing them in new APIs on the platform. In this talk I want to present an approach that doesn‘t replace anything - it embraces and builds on top of existing iOS API patterns. I will use an example (open-source) live app that shows: what’s the correct way to use MVC how to efficiently use DI (Dependency Injection) to properly transfer input data/configuration throughout the apphow and when to use Delegate pattern where and how to use Coordinators to manage data flow and display VCs, with minimum amount of boilerplate code where do components like network and API wrappers fit into the app how to create single point of data source for any other component in the app how to persist data in such a way that you can easily replace all of it with something else (say switch from Core Data to Realm) Each of the components is loosely coupled with the rest, each component does not care about the rest of the app. This separation of concern leads to easier testing, simpler maintainance and large degree of freedom to change data flow or even completely replace certain parts. If the architecture must have a name, MVC-C-DNA would suffice. :) –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Highly-maintainable-App-Architecture-Aleksandar-Vacic/"},{"title":"How I Spent All My Savings Reinventing Programming - Luis Solano","text":"I’m sure you’ve had the same question too: what is “The Best Way™” of programming? Agile? TDD? Haskell? Pair programming? I believe the answer has nothing to do with that. I’ve spent the last two years thinking exclusively about this question and working towards a solution. Do silver bullets exist? Come find out. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-How-I-Spent-All-My-Savings-Reinventing-Programming-Luis-Solano/"},{"title":"How to get started contributing to open source projects - Felix Krause","text":"Felix will talk about why open source is crucial for our ecosystem, how it can benefit you, and how to get started contributing. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-How-to-get-started-contributing-to-open-source-projects-Felix-Krause/"},{"title":"Hyper fast app development with React Native - Fabio Pelosin","text":"The innovation which surrounds the React Native and the larger Javascript community is worth taking a look at. In this talk I’ll explore the speed of development which can be reached with React Native, the unexpected benefits of this stack, and how developing with it is in practice. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Hyper-fast-app-development-with-React-Native-Fabio-Pelosin/"},{"title":"Lightweight Markup Parsing - Guillermo Gonzalez","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Lightweight-Markup-Parsing-Guillermo-Gonzalez/"},{"title":"Measuring performance in production - Francisco Javier Fernández Toro","text":"Lightning Talk. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Measuring-performance-in-production-Francisco-Javier-Fernandez-Toro/"},{"title":"Metaprogramming in Swift - Krzysztof Zabłocki","text":"Lets take a look at recently released Sourcery and how it can be applied in variety of different use-cases to make development more powerful and enjoyable, while at the same time limiting amount of human mistakes. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Metaprogramming-in-Swift-Krzysztof-Zablocki/"},{"title":"Start Where You Are Iterating at Scale - Kathy Tafel","text":"There’s lots and lots and lots of case studies and tutorials and SDKs and best practices that help you build and design systems from scratch. But not so many about iterating at scale. This talk covers building out a light weight system able to handle millions of consumers from client to server. What are the considerations of scale and the choices you have to make when you are already operating at a level where integrating other solutions is expensive? How do you manage negotiating features with your non-iOS engineer colleagues? How do you go determine MVP vs MaxVP? How do you measure success? –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Start-Where-You-Are-Iterating-at-Scale-Kathy-Tafel/"},{"title":"My Road to Damascus (or How I came to seriously consider Functional Reactive Programming) - Abizer Nasir","text":"I’m normally a vanilla programmer. I like classic programming paradigms, and people who know me will tell you that I’m not a fan of third partly libraries. But, I’m a contractor, and that means I need to be able to do things that I wouldn’t normally do Not only is FRP (RxSwift for the purposes of this talk) a large single dependency to add to a project, it also encourages a different programming style. I’ve spoken to people about FRP and I’ve been told that they see it as very abstract and can’t find simple examples of these differences (beyond the classic example of validating a username and password). This talk will try to correct that by providing a side by side comparison and people can make their own minds up about whether it is something that they want to incorporate into their own apps. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-My-Road-to-Damascus-or-How-I-came-to-seriously-consider-Functional-Reactive-Programming-Abizer-Nasir/"},{"title":"Real World Accessibility - Sommer Panage","text":"As an iOS developer working in accessibility at both largecompanies and small start-ups, I’ve come away with many anecdotes andlessons. In this talk, I’ll share three concrete stories about what itmeans to work on accessibility at real jobs. We will go beyond demo appsand sample code to discuss real issues, both in the technical andproduct development areas. The goal of this talk is to highlight some ofthe interesting challenges you might face in your own accessibility workas well as possible pathways forward. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Real-World-Accessibility-Sommer-Panage/"},{"title":"Stop Making Average Apps - Sally Shepard","text":"If you’re only ever thinking about the “average” user, you’re probably making an app for no one. Each user has different needs, so how do you create interfaces that are simple yet flexible? In this talk you’ll learn why Dynamic Type is important and how to support it in your apps. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Stop-Making-Average-Apps-Sally-Shepard/"},{"title":"Taming Animations - Sash Zats","text":"Animations set iOS apart from Android, they are signature garnish on top of every app recognized by Apple Design Awards. Over the years we accumulated many technologies allowing to build animations from simplest color changes to immersive experiences that make us praise the app on Twitter. But which one is the right for you? Are you sure you know all the options out there? Learn about many 1st and 3rd party frameworks, get to know their strong sides, be aware of their shortcomings. Get your definitive guide on animations! –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Taming-Animations-Sash-Zats/"},{"title":"Understanding code signing x509 and Apple - Marin Usalj","text":"Every iOS developer has hit the wall of trying to publish an iOS app. Code signing is one of the most hated topics in the field: it’s obscure, complicated and not well understood. The talk will clarify all the components in the code signing process, and show how they play together. It should save you some time in the future, or you get all your money back™! The talk will go over private keys, .p12 archives, certificates, CSRs, provisioning profiles, teams, and show some usages in practice. –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Understanding-code-signing-x509-and-Apple-Marin-Usalj/"},{"title":"Why You Shouldn't Write Tests (Yes, We're Going There) - Dave Schukin","text":"The iOS development community is generally split into two factions when it comes to writing automated tests: Those that timidly don’t write tests, mostly due to the difficulty of doing so on iOS, but quietly recognize their value Those that vocally advocate for writing tests, and continuously build new tools &amp; frameworks for testing, as well as educate the rest of the community For the most part, those in group B are correct, as tested code is generally better code. (The title of this talk is intentionally misleading.) However, there are many scenarios in which writing tests can actually be detrimental to your app, to your team, to your launch, to your users, and to the success of your company. This talk will cover: A brief history of testing in iOS When &amp; why you should write tests When &amp; why you should skip writing tests: Building apps for pre-seed startups, building experimental features that will be rolled out to 1% of users, features that are almost entirely UI, and many other scenarios. A comparison of different team structures, application types, and in which of these testing is best skipped. This is intended to be a controversial yet educational talk, that is both technical &amp; humorous in nature. :) –Recorded and produced live by Stefan Völker.NSSpain 2017.","link":"/NSSpain/2017/NSSpain-2017-Why-You-Shouldn't-Write-Tests-Yes-We're-Going-There-Dave-Schukin/"},{"title":"A Better MVC - Dave DeLong","text":"Recent years have seen the adoption of patterns like MVVM, VIPER, DISCOVER, FRP, and React as an attempt to work around the apparently-intrinsic problems many developers face when using MVC. In this talk, we’ll explore the philosophy that underlies MVC, and how applying the principle of decomposition can solve these problems, while at the same time promoting reusability, testability, and making your codebase a pleasant and well-organized work of art. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-A-Better-MVC-Dave-DeLong/"},{"title":"Avant-garde Programming Patterns - Benedikt Terhechte, Martin Kim Dung-Pham & Rich Barton","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Avant-garde-Programming-Patterns-Benedikt-Terhechte-Martin-Kim-Dung-Pham-and-Rich-Barton/"},{"title":"Avoiding culture shock. Designing apps for different cultures. - Daniel Munoz","text":"When we need to ship apps to different countries we usually only rely on localization. Sometimes it is not enough. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Avoiding-culture-shock.-Designing-apps-for-different-cultures.-Daniel-Munoz/"},{"title":"Building apps at scale - Pavel Mazurin & Victor Pena","text":"Slides: http://t.uber.com/nsspain2018 Most well known mobile architectures start to work against you after your engineering team grows large. A new architecture paradigm is needed to support the development of mobile applications with hundreds of mobile engineers. At Uber, we’ve been through this journey, growing from one mobile developer to hundreds. After investigating many other mobile architectures, we created RIBs: a platform-agnostic mobile architecture designed with reliability, testability, isolation and maintainability in mind. We re-wrote the Uber application in 4 months with 200 engineers. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Building-apps-at-scale-Pavel-Mazurin-and-Victor-Pena/"},{"title":"Embrace your Legacy… Code - Nelida Velazquez","text":"Working with legacy code can be challenging and sometimes a little frustrating. In this talk, I would like to explore the positive side of it and how it can help to grow your skills and become a better developer. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Embrace-your-Legacy...-Code-Nelida-Velazquez/"},{"title":"Combinators - Daniel Steinberg","text":"Just as with OO, one of the keys to a functional style of programming is to write very small bits of functionality that can be combined to create powerful results. The glue that combines the small bits are called Combinators. In this talk we’ll motivate the topic with a look at Swift Sets before moving on to infinite sets, random number generators, parser combinators, and Peter Henderson’s Picture Language. Combinators allow you to provide APIs that are friendly to non-functional programmers. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Combinators-Daniel-Steinberg/"},{"title":"Embracing Change - Kristina Fox","text":"My team has gone through a lot of changes over the last year. We went from 6 iOS engineers to a merged team of 30 and is currently going through a redesign, language rewrite and re-architecture of our app. This talk would share some of our learnings from what went well and what didn’t go well throughout this journey. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Embracing-Change-Kristina-Fox/"},{"title":"From Engineer to Manager A personal journey - Marcus Wermuth","text":"This talk is a story - a story of how I went from being a senior iOS/Android Developer to a Manager. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-From-Engineer-to-Manager-A-personal-journey-Marcus-Wermuth/"},{"title":"Going Deep With Animations in iOS - Hector Matos","text":"–Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Going-Deep-With-Animations-in-iOS-Hector-Matos/"},{"title":"How To Control The World - Stephen Celis","text":"On a daily basis we work with APIs that interact with the outside world. These APIs can be inconsistent, unreliable, or fail. As we sprinkle calls to these APIs throughout our applications, we often make our own code more difficult to work with, test, and be confidence in. This talk covers a simple, effective solution to taking control of the outside world, improving the way we work with our code in dramatic ways. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-How-To-Control-The-World-Stephen-Celis/"},{"title":"React Native Unfiltered Insights from Introducing React Native to a Production Application - Isabel Barrera","text":"Is your team considering introducing React Native into an existing production application? This talk will focus on some of the challenges of taking a hybrid approach to React Native, including hybrid feature architecture, performance, and team dynamics. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-React-Native-Unfiltered-Insights-from-Introducing-React-Native-to-a-Production-Application-Isabel-Barrera/"},{"title":"Scaling up mobile at ING - Bart den Hollander","text":"Want to know how a large banking app as ING creates maintainable iOS frameworks that will be used by multiple countries? I’ll share all insights about what it takes to scale up a large codebase, how to maintain it and the lessons learned. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Scaling-up-mobile-at-ING-Bart-den-Hollander/"},{"title":"Siri Shortcuts - Ellen Shapiro","text":"–Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Siri-Shortcuts-Ellen-Shapiro/"},{"title":"Stacktrace Live Podcast - John Sundell & Guilherme Rambo","text":"https://stacktracepodcast.fm –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Stacktrace-Live-Podcast-John-Sundell-and-Guilherme-Rambo/"},{"title":"Solving callback hell with good old function composition - Vincent Pradeilles","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Solving-callback-hell-with-good-old-function-composition-Vincent-Pradeilles/"},{"title":"Strings Seven Ways - Mattt","text":"(Note: Unfortunately, there were technical problems when recording this talk, as a result it has poor audio quality and some footage of the beginning is missing. But it’s still an amazing presentation that’s worth sharing. Thanks for bearing with us, we hope you enjoy it) Strings are the most versatile type in the Swift standard library. This talk looks at seven different ways to understand and work with strings: as collections of Unicode characters, as identifiers, as paths, as natural language text, as encoded data, as structured data, and as typographic content. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Strings-Seven-Ways-Mattt/"},{"title":"Synthesizing Synths in Swift - Adam Bell","text":"iOS is a fantastic platform for building musical instruments, so let’s learn some audio theory and make some synthesizers in Swift! –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Synthesizing-Synths-in-Swift-Adam-Bell/"},{"title":"Teaching Swift at Scale - Paul Hudson","text":"Each year, one million users visit the Hacking with Swift website to learn something new about Swift, iOS, and more. In this talk I’ll walk you through the main problems people hit, what that tells us about the state of Swift development, and how trends have changed over time. More specifically, I’ll cover how people are keeping up with changes to the language, which APIs continue to be most problematic, and how our community is slowly drifting apart on architectures. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Teaching-Swift-at-Scale-Paul-Hudson/"},{"title":"The Art of Spelunking - Guilherme Rambo","text":"The talk will start with an overview of what reverse engineering is, what you can achieve with it and what are the basic tools used. I’ll then dive into a practical demo of how I used that knowledge to find references to unreleased features on HomePod by hacking the iOS Simulator. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-The-Art-of-Spelunking-Guilherme-Rambo/"},{"title":"UI Testing Infrastructure in Avito - Vladislav Alexeev","text":"We rely on UI testing heavily: we now have more than 500 e2e tests that we need to run and maintain. The perfect infrastructure is a key of the success. I cover what we use for testing, what problems we’ve met and how we solve them. –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-UI-Testing-Infrastructure-in-Avito-Vladislav-Alexeev/"},{"title":"Thoughts on Vapor - Pier Cifani","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Thoughts-on-Vapor-Pier-Cifani/"},{"title":"SwiftConf '18 - Daniel Steinberg Keynote – Stabilizing your ABI","text":"The focus of Swift 5 is ABI stabilization. This is a big moment in the evolution of this language we depend so much on. We begin this year’s Swift Conf with a look at what ABI Stabilization means in the life of the Swift Programming Language and what it could mean in your life. https://twitter.com/dimsumthinking https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Daniel-Steinberg-Keynote-Stabilizing-your-ABI/"},{"title":"Unit Testing UIViewControllers - Parveen Kaler","text":"⚡️Lightning Talk –Recorded and produced live by Stefan Völker.NSSpain 2018.","link":"/NSSpain/2018/NSSpain-2018-Unit-Testing-UIViewControllers-Parveen-Kaler/"},{"title":"SwiftConf '18 - Egor Tolstoy Developer experience","text":"Problem validation, roadmaps, usage metrics and feedback, user experience are not first-class citizens in internal platforms and tools development. I’ll talk about developer experience, an approach that helps our engineers create useful, thriving and developer-oriented technical products. https://twitter.com/igrekde https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Egor-Tolstoy-Developer-experience/"},{"title":"SwiftConf '18 - Manu Rink Grow your own model (ML on iOS)","text":"Wouldn’t it be great to “just” have an own machine learning model to detect if cats are smiling or just looking evil? Or detect the own handwriting in a split of a second - completely offline? It’s easy, but not simple - so let’s dive into it! This talk shows how to get started with ML by training your own model which then can be used with CoreML. https://twitter.com/codePrincess https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Manu-Rink-Grow-your-own-model-ML-on-iOS/"},{"title":"SwiftConf '18 - Mateusz Stawecki Server-side swift without the servers?","text":"Function as a service (FaaS) a.k.a. the mysterious “Serverless” is the latest frontier for cloud platforms like AWS, Azure, IBM Cloud. It promises to run your backend Swift code without having to worry about infrastructure or server maintenance. But what about your existing Kitura/Vapor applications? In this talk we’ll explore running Swift in the cloud without having to provision servers or containers. How Serverless can allow us to focus on doing what we love - writing Swift code - and sleep better at night without worrying about server uptime. https://twitter.com/stawecki https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Mateusz-Stawecki-Server-side-swift-without-the-servers/"},{"title":"SwiftConf '18 - Jakub Turek Always Give 100%","text":"The talk is about unit testing and developing iOS apps in TDD with Swift. It will cover a plethora of tips and techniques that me and the team has discovered en route to the app with 200K lines of Swift at nearly 100% code coverage.The talk will highlight the techniques of structuring the code so that it is easily testable. It will demonstrate how to overcome common pain points, such as testing view controllers or the test-first approach for views built entirely in code. It will also show how to refactor the test code for better readability, for example using Sourcery code generation tool.It doesn’t matter whether you have never written a single test case or are a veteran looking to push the testing to the limit. If you are like me and want the days of debugging through piles of unmaintainable code to be over, this talk is definitely for you! https://twitter.com/KubaTurek https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Jakub-Turek-Always-Give-100percent/"},{"title":"SwiftConf '18 - Oscar Falmer How to ARKit 2.0","text":"Skip part with bad audio: https://youtu.be/Y5Ki-MKVP_0?t=2m30s ARKit 2.0 is coming up with iOS 12 with exciting new features such as Image Live Tracking and 3D Object Detection. Let’s dive into these two features with some technical aspects and code examples. https://twitter.com/osfalmer https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Oscar-Falmer-How-to-ARKit-2.0/"},{"title":"SwiftConf '18 - Paul Hudson Mastering iOS Animation","text":"We all know that animations help your apps look better,but they also help your readers understand what’s changing in your appand why. In this session you’ll learn how to make fantastic animationsfor iOS, using the latest APIs from Apple. https://twitter.com/twostraws https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Paul-Hudson-Mastering-iOS-Animation/"},{"title":"SwiftConf '18 - Shai Mishali RxSwift debunking the myth of hard","text":"RxSwift has been one of the most prominent and upcoming frameworks in the iOS &amp; Swift community in the past years. Its usage is becoming widespread and popular with many companies moving their code base to the Reactive world across iOS, Android, Web and Backend - making it a valuable skill to comprehend.Along with that fact thought, it seems the learning curve for RxSwift and Rx in general always seems “hard” to most people, or too hard to get started with. In this lecture I hope to debunk the myth and misconception of RxSwift being a hard concept, and put developers on the right path to start building Reactive Mobile applications for the modern world. https://twitter.com/freak4pc https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Shai-Mishali-RxSwift-debunking-the-myth-of-hard/"},{"title":"SwiftConf '18 - Panel","text":"https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Panel/"},{"title":"SwiftConf '18 - Steffen Sommer Same language, different platform","text":"Skip part with bad audio: https://youtu.be/vesAhaiaujA?t=13m55s Same language, different platform - searching for synergy between iOS and Vapor Being able to share code between an iOS app and a backend running server-side Swift was one of the first things I thought about when Swift went open source. It’s been a common argument for choosing a server-side Swift framework ever since, although there’s been little focus on what is actually possible. With this talk I will dive into the current possibilities and limitations for sharing code between iOS and Vapor and I will look ahead and discus how this might change in the future. https://twitter.com/steffendsommer https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Steffen-Sommer-Same-language-different-platform/"},{"title":"SwiftConf '18 - Stuff The importance of Privacy in iOS","text":"A lot of time Privacy of my data as a user is not a priority for Developers. Wether it’s my calendar, my contacts, my location, I want as a user to be able to use an app without all of those attacks in my privacy. I want to summarize some things an iOS developer should do to ensure the most critical user can still use my app in some regards, and not just say “I need all your information” like on other platforms. This is the beauty of iOS, being able to fine grained (although not enough) so let’s do this all together, as a beautiful community concerned by Privacy. https://twitter.com/stuffmc https://swiftconf.comhttps://twitter.com/swiftconf","link":"/SwiftConf/2018/SwiftConf-2018-SwiftConf-'18-Stuff-The-importance-of-Privacy-in-iOS/"},{"title":"All about linking libraries","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - All about linking librariesSpeaker - Kishikawa Katsumi Twitter - https://twitter.com/k_katsumi Bio - iOS Developer. Love to create small tools for developers. Abstract - When developing an iOS application, you rarely do not use libraries or framework.We use OS provided frameworks such like UIKit and Swift standard libraries. We also use useful third-party libraries.aAt the same time, everyone may have suffered from link errors, duplicate symbols, weird error messages from package managers.It is difficult to solve link errors because the cause of the problem comes from various things such as project setting, the library is static or dynamic, distribution method of the library or execution environment (on device or simulator). Learning the mechanism of the link makes you possible to solve the problems. In this talk, I will explain about a library and framework which can be used for iOS applications and explain the mechanism of how external libraries will be linked with your applications. Presentation Link - https://speakerdeck.com/kishikawakatsumi/all-about-linking-libraries try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-All-about-linking-libraries/"},{"title":"Assembly. You can do it!","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Assembly. You can do it!Speaker - Andrew Madsen Twitter - https://twitter.com/armadsen Bio - Andrew is director of the iOS program at Lambda School. He has been doing Cocoa development for the last 14 years, with a particular focus on audio and video apps for creative people. A full time iOS teacher for the past three years, he loves sharing the wonderful world of Swift and iOS with new programmers. Andrew is also co-host of the iPhreaks iOS development podcast, and enjoys being a part of the developer community. Despite embracing Swift starting in 2014, Objective-C will always be his first love. Abstract - We’ve all had the experience of debugging an app only to end up looking at a wall of assembly that seems impossible to understand. Or maybe you’ve wanted to look at the source code for a UIKit method to understand why it behaves the way it does. In this talk, I’ll show you that even us regular developers can learn enough assembly to help track down bugs, to reverse engineer parts of the system frameworks, and to understand our own code more deeply. Presentation Link - https://www.andrewmadsen.com/AssemblySlides.pdf try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Assembly.-You-can-do-it!/"},{"title":"Building a Mobile Design System","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Building a Mobile Design SystemSpeaker - Kristina Fox Twitter - https://twitter.com/krstnfx Bio - Kristina Fox is a Senior iOS Engineer at Intuit. She writes tutorials and technical commentary on iOS and watchOS development on her website kristina.io. As an international speaker, she has presented on topics ranging from Apple Watch development to using technical writing to advance engineering skills. Her past speaking events include talks at AltConf, NSSpain, iOSDevUK and many more. Kristina’s main goal in life is to consume as much avocado toast as she can. She also enjoys watching cat videos and Twittering. Find her on Twitter @krstnfx. Abstract - Learn how to build a mobile design system from the ground up. Learn what a design system is, how it’s useful to your team, how it can help speed up your development and the first 3-5 things you need to focus on to get started successfully. Presentation Link - https://speakerdeck.com/krstnfx/building-a-mobile-design-system try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Building-a-Mobile-Design-System/"},{"title":"Building a Social Network in Swift","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Building a Social Network in SwiftSpeaker - David Okun &amp; Ian Partridge Twitter https://twitter.com/dokun24 https://twitter.com/alfa Bio - David Okun is a mobile software developer turned developer advocate for IBM in Austin, Texas. David has been primarily focused on iOS mobile software, but is also interested in Swift on the Server, and other web technologies such as Node.js. Ian Partridge is the technical lead of the Swift@IBM development team, working in open source to bring Swift to the cloud. A committer to the core Swift libraries and a developer of Kitura, one of the leading Swift web frameworks, he comes from a background in virtual machine performance and debugging. Ian regularly speaks at conferences including AltConf, iOSCon, dotSwift, SwiftConf and more. Abstract - “But is it really ready for production?” Server-side Swift has come a long way in just a few years. Ian Partridge and David Okun will show how full-stack Swift is ready for your next project, along with the open standards you can take advantage of as you go live on the cloud. Spend more time writing Swift and less time talking about it! Presentation Link https://speakerdeck.com/dokun1/building-a-social-network-in-swift https://speakerdeck.com/ianpartridge/building-a-social-network-in-swift try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Building-a-Social-Network-in-Swift/"},{"title":"Color Contrast for Accessibility","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Color Contrast for AccessibilitySpeaker - Liz Marley Twitter - https://twitter.com/emarley Bio - Liz is a 13-year veteran of the Omni Group, now an iOS engineer at Nordstrom. She has also organized App Camp for Girls in Seattle several times. She speaks at conferences as an excuse to learn new things and hang out with other macOS and iOS developers. She hasn’t written any books or hosted any podcasts…yet. Abstract - How much text contrast is enough? Instead of quibbling over shades of gray, we can use an equation to evaluate relative luminance and ensure more of our users can experience our content. An overview of the science behind the equation, and an exploration of some edge cases. Presentation Link - https://github.com/emarley/ColorContrast try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Color-Contrast-for-Accessibility/"},{"title":"Contributing to Swift Compiler","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Contributing to Swift CompilerSpeaker - Yusuke Kita Twitter - https://twitter.com/kitasuke Bio - I’m a Software Engineer at Mercari. I’ve been working on Mercari US app in frontend and backend team. I’m passionate about learning new technology. When not coding, you can find me cycling. Abstract - Do you want to contribute to Swift Compiler? If you have cool idea, it’s a good enough reason to start. It’s challenging, but Swift community helps you a lot!In this talk, we’ll cover overview of Swift Compiler and go over how and where to start. Presentation Link - https://www.slideshare.net/kitasuke/contributing-to-swift-compiler try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Contributing-to-Swift-Compiler/"},{"title":"Discover memory leak with Testcase","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Discover memory leak with TestcaseSpeaker - Nobuo Saito Twitter - https://twitter.com/tarunon Bio - Nobuo, a.k.a tarunon is working at Mercari. He likes to cook, play games and program. He doubled the time he plays games because he updated Splatoon before the release of the Smash Brothers SP. Abstract - In Swift, memory are managed with ARC, so it’s occured memory-leak easily with bad code. How do you avoid memory-leak? Coding rules, Code review or QA as last bastion? Of course we are lazy, so we like something automated than effort or guts. As 4th way, I’d like to talk about test case implementation with Mirror. Presentation Link - https://www.icloud.com/keynote/0v-uQow7QXtpwDMs2CN8LHxiQ#try!swift2019tarunon try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Discover-memory-leak-with-Testcase/"},{"title":"次へつなごう— Extending a hand to the next generation of Apple developers","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - 次へつなごう— Extending a hand to the next generation of Apple developersSpeaker - Mayuko Inoue Twitter - https://twitter.com/hellomayuko Bio - Mayuko is an iOS Engineer and the founder of helloMayuko, a youtube channel with over 200,000 subscribers aimed at helping make the tech industry feel more accessible to those trying to enter. She creates vlog-style videos about software development and other topics to demystify the life and career path of a Software Engineer. She is passionate about the creating products that help people, the creative arts, and boppin music. Abstract - It’s never been a better time to start learning how to code. Technologies are evolving and growing every day, and with Apple’s recent advances in Swift and Swift playgrounds, Apple development has never been easier to try. However in the tech industry, there still exists a large gap between individuals trying to enter the industry as a Software Engineer, and the hiring demands of tech companies trying to fill their engineering roles. This talk will focus on this gap - the leaky bucket we see in the demographics of Software Engineers. We’ll talk about how we as Software Engineers can strengthen the existing Apple developer community by discussing how we can extend a hand to those trying to enter. This will involve topics such as sharing perpsectives from non-Software Engineers about the difficulties of breaking the barrier, as well as the unique opportunity that Swift and this Apple developer community can provide. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Extending-a-hand-to-the-next-generation-of-Apple-developers/"},{"title":"Driving Engagement with Siri Shortcuts and NSUserActivity","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Driving Engagement with Siri Shortcuts and NSUserActivitySpeaker - Nic Laughter Twitter - https://twitter.com/nictheawesome Bio - Nic Laughter is a technophile currently living in Utah. *He is on the Autism spectrum and has a passion for helping companies see the hidden potential in hiring neuroatypical engineers. He has been writing code since 2015 and currently works as a software engineer generalist at Jane.com, primarily working on the main iOS app and occasionally contributing to the website and React Native seller app. He sometimes blogs on Medium, and in his spare time you can find him making music, playing video games, or hanging out with his family. Abstract - Siri Shortcuts is a new technology that enables the user to identify specific paths within an app they use often to be done quickly and easily using Siri. By enabling this capability in your apps, you can drive higher engagement and more ease of use with your app! Presentation Link - https://github.com/tryswift/tokyo2019slides/tree/master/NicLaughter try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Driving-Engagement-with-Siri-Shortcuts-and-NSUserActivity/"},{"title":"Deep dive into Swift Literal","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Deep dive into Swift LiteralSpeaker - Yuki Aki Twitter - https://twitter.com/___freddi___ Bio - Yuki is an iOS Developer at LINE Fukuoka. From started intern, his Quority of Life and weight has increased so that he is in a diet. Reacently I read Swiftc and SIL so hard. When he’s not coding, he likes to draw cat illustration. Abstract - In this talk, I’ll talk about Swift Literals to your deeply understanding. By following the “”Literal Object”” journey from Swift Code to SIL, and LLVM IR code, you can see how literals are handed over to the app as exact data from code string, with Intrinsic Protocols. Also, I’ll focus on Literal exploitation using Intrinsic Protocols and new features for literals in Swift 5.0. By my talk, you will be a developer well known about Swift Literal. Presentation Link - https://freddi.dev/resources/AkiYuki%20-%20Deep%20Dive%20into%20Swift%20Literal.pdf try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Deep-dive-into-Swift-Literal/"},{"title":"Generics in protocol extension","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Generics in protocol extensionSpeaker - Hikaru Yoshimura Twitter - https://twitter.com/_yuu_ Bio - Hikaru Yoshimura works as a Scala engineer. He used to study type systems when he was in the university so he can program using some functional languages a little bit. He sometimes brings the good parts of languages like Scala, Haskell or OCaml to Swift. Abstract - The protocol only handle existensial type like associateType. For some protocol, when we give some functions in protocol extension, we must put a concreate type. Protocol extension will work like searching function based on type, so it’s needed concreate type in somewhere. For example, for some type called A, sometimes we want to write extension using List[A] finaly. In this talk, I’d like to consider how to create generics by force from existensial type like associatedType by using Curry-Howard correspondence. Presentation Link - https://github.com/y-yu/try-swift-slide try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Generics-in-protocol-extension/"},{"title":"Graphics like Pixar using Swift","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Graphics like Pixar using SwiftSpeaker - Michael Petrie Twitter - https://twitter.com/kapsy1312 Bio - My name is Michael Petrie, but everyone calls me Kapsy. I work for ZOZO Technologies and lead the iOS measurement framework team. I have a background in games and real time programming, using C and C++, and yearn for the day when we can all decide on a common ISA (Instruction Set Architecture) and be happy. Abstract - This is a talk about some of the hurdles faced when writing a simple Ray Tracer from scratch, using Swift.Ray Tracing is the cornerstone of Pixar’s infamous Renderman 3D rendering technology, which dominates the animated film industry. It works by physically modeling light rays and their interactions with objects and surfaces. Within recent years there has been a renewed interest in real time Ray Tracing, with the advent of more powerful and specialized hardware such as NVIDIAs RTX. Even renowned programmer John Carmack has stated that “”all roads lead to Rome””, when asked about the future of real time computer graphics and Ray Tracing. While I enjoy working with traditional graphics rasterizers, I have always been interested in physically modeling light, and have wanted to learn more about the processes involved. Here I talk about how I programmed a Ray Tracer that renders a simple scene from first principles. Given the timing, it also seemed like the perfect opportunity to test the versatility of Swift. Presentation Link - https://github.com/tryswift/tokyo2019slides/tree/master/MichaelPetrie try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Graphics-like-Pixar-using-Swift/"},{"title":"In defense of Core Data","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - In defence of Core DataSpeaker - Donny Wals Twitter - https://twitter.com/DonnyWals Bio - I’m a passionate and curious iOS developer, Author and Speaker. I currently work at Disney on our internal iOS SDK. I have written three books on iOS development and have delivered several talks and workshop over the past couple of years. Next to iOS development I’m a huge cat lover and I like noodling on my guitar. Abstract - Over the year, Core Data has gained a pretty bad reputation amongst developers who prefer to use another service like Realm for their local persistence. In this talk I will make an argument for using Core Data and why it’s not so bad. I will share some examples of where it’s easy to go wrong with Core Data, and how to avoid those pitfalls. I will also quickly go over setting up Core Data in an app and by the end the audience should have a couple of simple rules that should help them safely integrate Core Data in their apps. Presentation Link - https://www.slideshare.net/donnywals/in-defense-of-core-data try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-In-defense-of-Core-Data/"},{"title":"Introducing SourceKit-LSP","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Introducing SourceKit-LSPSpeaker - Ryo Izumi Twitter - https://twitter.com/izm256 Bio - Ryo is an iOS Developer at Nohana. He likes to drink sake so much. Abstract - Language Server Protocol (LSP) has attracted attention today, and some Language Server of various programming language has been developed. Swift is no exception. SourceKit-LSP was announced in 2018, and development is still continuing now. In this talk, I’d like to talk about the outline of LSP and future development environment using SourceKit-LSP. Presentation Link - https://speakerdeck.com/rizumi/introducing-sourcekit-lsp try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Introducing-SourceKit-LSP/"},{"title":"MachObfuscator","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - MachObfuscatorSpeaker - Kamil Borzym Twitter - https://twitter.com/kam800 Bio - Kamil is an iOS software developer. He is very curious of how things work internally, so he likes to decompile frameworks and apps. Abstract - I will show you a completely new approach to iOS app obfuscation. MachObfuscator is an open-sourced binary obfuscator written in pure Swift. Presentation Link - https://github.com/tryswift/tokyo2019slides/tree/master/KamilBorzym try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-MachObfuscator/"},{"title":"Limited import clarification and its effect","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Limited import clarification and its effectSpeaker - Tomoya Hirano Twitter - https://twitter.com/noppefoxwolf Bio - Tomoya is iOS developer at DeNA and works on Pococha, which is live streaming app. He loves fox so much🦊💕 Abstract - Import is able to explicitly specify submodules or specific elements.In this session, I will review the specifications of these imports and consider the impact on binary size and performance. Presentation Link - https://speakerdeck.com/noppefoxwolf/tryswift2019 try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Limited-import-clarification-and-its-effect/"},{"title":"Making Portrait mode yourself","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Making Portrait mode yourselfSpeaker - Rina Kotake Twitter - https://twitter.com/https://twitter.com/koooootake Bio - Rina started to work at DeNA from 2017. From she was child, her dream is being “”Pokemon master””. In 2011 MITOU Program, which discover and develop young talents called “”Creators”” who are capable of accelerating innovation and playing a key role in creating next-generation IT markets, she adopted this program and open her eyes up to the fun in making things. She attended a lots of hackathon and contest and got over 25 awards. Now she develops “”MangaBox”” iOS app. Abstract - On the iPhoneX series, with dual cameras, you can blur the background using depth information and finish beautiful portrait photographs.In this talk I will talk about the process of separating and blurring the foreground and background from the image “”without depth information””, blurring the portrait mode, swigging with Swift, finishing beautiful pictures. Presentation Link - https://speakerdeck.com/koooootake/making-portrait-mode-yourself try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Making-Portrait-mode-yourself/"},{"title":"Native macOS application, or the world of AppKit","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Native macOS application, or the world of AppKitSpeaker - 1024jp Twitter - https://twitter.com/1024jp Bio - 1024jp is hobby macOS developer/designer. Besides working as a professional academic researcher in real life, 1024jp invests entire leisure time in developing macOS applications by doing every process from coding to drawing icons. The most active project is CotEditor, a native macOS plain-text editor. CotEditor is currently one of the largest open-sourced macOS application written in Swift but has been developed by 1024jp alone since CotEditor was officially taken over from the ex-developer five years ago. Besides, 1024jp organizes also “macOS native,” a community for sharing knowledge about native macOS app development in Japan. Abstract - Swift is the language which we cannot build native application in the iOS or macOS world without, but what is the native application? Is it the native application using Cocoa framework with Swift? To be proved native merits, programmers should know frameworks well, be familier with Human Interface Guidelines and understand target OS well. By the way, we feel that Marzipan is just around corner. In this talk, I’d like to talk about the essential point of view in building beautiful macOS native applications. Presentation Link - https://speakerdeck.com/1024jp/native-macos-application-or-the-world-of-appkit try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Native-macOS-application-or-the-world-of-AppKit/"},{"title":"Introduction to Swift Keypaths","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Introduction to Swift KeypathsSpeaker - Benedikt Terhechte Twitter - https://twitter.com/terhechte Bio - Benedikt works as a Senior iOS Developer at the professional network XING. In previous jobs he developed solutions for customers such as Disney or Daimler-Chrysler. As an Indie Mac developer, he launched successful apps such as PhotoDesk and Hirundo. Benedikt started investigating Swift right after the 2014 release and writes about it on his popular blog. He also initiated the Core Value and SourceKittenDaemon open source projects Abstract - Keypaths were added in Swift 4. They’re a fantastic feature but sometimes it feels difficult to find good situations for using them. However, when understood and used the right way, keypaths allow you to implement additional abstractions into your codebase that would be much harder with generics or protocols. In order to be able to do that, though, it is useful to intuitively understand when to apply the Keypath pattern. This talk will first explain the different types of keypaths that exist and then go through real world examples to showcase how they can be leveraged in your own projects. Presentation Link - https://speakerdeck.com/terhechte/introduction-to-swift-keypaths try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Introduction-to-Swift-Keypaths/"},{"title":"Property-based test beginning with SwiftCheck","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Property-based test beginning with SwiftCheckSpeaker - Yusuke Hosonuma Twitter - https://twitter.com/tobi462 Bio - Yusuke is working at DeNA SWET group. He recognizes how beautiful of Functional Programming and study Haskell now. He likes to solve algorithm problems with Haskell, with automated testing. Abstract - There is a method called Property-based Testing that describes the logical properties that the function should satisfy and generates random input values ​​to test. It’s based on Haskell ‘s QuickCheck is the main source, and it has been ported to many languages ​​and also Swift has an OSS called SwiftCheck. In this talk, I’ll show you the concept of Property-based Testing and how to describe with SwiftCheck. Presentation Link - https://speakerdeck.com/yusukehosonuma/property-based-test-beginning-with-swiftcheck try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Property-based-test-beginning-with-SwiftCheck/"},{"title":"Psychology study background and prospects in iOS device","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Psychology study background and prospects in iOS deviceSpeaker - Yuto Mizutani Twitter - https://twitter.com/expensive_man Bio - Yuto is new graduate iOS developer at VALU. He hopes to bridge scientific research and technology. He has been working with iOS (Swift) in collaboration with external organizations since he was student. He likes electronic work, so his dream is to build fully automated home. Abstract - In past psychology study, experiments using Personal computer or physical lebber has conducted. And today the way is changing that experiments using touch screen for human or other animals are increased. In this talk, I’d like to show you about the histrical background and iPad application using Swift, which cooporate with research institutes, then discuss the necessity and role for software technology in future science study. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Psychology-study-background-and-prospects-in-iOS-device/"},{"title":"Shaping Sounds in Swift","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Shaping Sounds in SwiftSpeaker - Adam Bell Twitter - https://twitter.com/b3ll Bio - Adam is a software engineer specializing in audio, animations, interactions, and gestures, currently working on Origami Studio at Facebook. When he’s not racing cars or messing with synthesizers, you’ll usually find him dabbling in the internals of Apple products or getting Doom to run on platforms it really wasn’t designed for (https://www.youtube.com/watch?v=GD0L46y3IqI) 🙃. Abstract - Sound design with synthesizers is always viewed as something incredibly complicated, however with Swift it doesn’t need to be. This talk will focus on the basics of sound synthesis, design, and how you can take really basic sounds and turn them into some of the most memorable of the century. Presentation Link - https://github.com/b3ll/try-swift-2019 try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Shaping-Sounds-in-Swift/"},{"title":"Swift Hardware Hacking","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Swift Hardware HackingSpeaker - Sally Shepard Twitter - https://twitter.com/mostgood Bio - Sally Shepard is an iOS developer, accessibility consultant, writer and hardware hacker who has worked on a wide variety of award winning apps. Before the iPhone existed, she studied audio engineering, a field which combined her love of music and tinkering with expensive hardware. She lives in London and in her spare time she enjoys playing any instrument with strings, attaching sensors to her cat and taking pictures with vintage cameras. Abstract - In this talk, we’ll explore how to use Swift to hack hardware.We’ll look at expanding the functionality of a cat coin bank (the one where you place a coin on top and cat pulls it into the coin bank) using a micro-controller and various sensors.We will: - Count money as it is deposited - Speak out the deposited amount/total balance - Connect to a phone via Bluetooth LE to send information between devicesThe purpose of this talk is to understand how to get started working with Swift and hardware, it will provide enough of a foundation so you can try projects on your own. Presentation Link - https://www.slideshare.net/mostgood/swift-hardware-hacking-try-swift try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Swift-Hardware-Hacking/"},{"title":"So you want to build an ARKit app","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - So you want to build an ARKit appSpeaker - Namrata Bandekar Twitter - https://twitter.com/NamrataCodes Bio - Namrata is a Principal Software Engineer at Zynga building addictive games. She is also a member of the Ray Wenderlich Tutorial Team. She is the co-author of ARKit by Tutorials and one of the Tech Editors on the Android Apprentice book. Apart from building apps, she is passionate about travelling, scuba diving and hiking with her dog. Abstract - ARKit has shown how AR can be integrated into apps to make them more engaging and fun. If you are thinking about using ARKit in your app, this talk is for you. This talk covers challenges I experienced when building ARKit apps such as ensuring good app performance, positioning virtual objects and working with planes. Learn how to use ARKit to its full potential, keep your AR apps performant and deliver a polished end user experience. Presentation Link - https://speakerdeck.com/namrata/so-you-want-to-build-an-arkit-app-appdevcon try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-So-you-want-to-build-an-ARKit-app/"},{"title":"Swift type metadata","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Swift type metadataSpeaker - Yuta Saito Twitter - https://twitter.com/kateinoigakukun Bio - Yuta is an intern at Mercari’s iOS team. He gets lost with Swift everyday in the beautiful world of types. His hobby recently is to read the Swift compiler. Abstract - Swift has type metadata, which can be stored type infomation on runtime. We don’t use directly not so much, but it’s important to understand the behavior of Swift runtime. In this talk, I’d like to talk about the type metadata and its implementation. Presentation Link - https://speakerdeck.com/kateinoigakukun/swift-type-metadata try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Swift-type-metadata/"},{"title":"Swift Server Update","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Swift Server UpdateSpeaker - Tom Doron Twitter - https://twitter.com/tomerdoron Bio - Tom works at Apple where he is serving as a senior engineering manager focusing on core cloud technologies and open source libraries and frameworks. Abstract - The Swift Server Work Group (SSWG) goal is to create a robust, healthy ecosystem for server application development with Swift. Its current focus is to encourage the development of high quality, well maintained libraries and tools that the community can reliably lean on. In this talk, we will review the latest development since the SSWG was announced Sept 2018, describe the incubation process and how to get involved, and dive into the details of some of the active projects and proposals the community and teams are working on. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Swift-Server-Update/"},{"title":"SwiftSyntax で便利を実現する基礎","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - SwiftSyntax で便利を実現する基礎Speaker - Yuki Kokubun Twitter - https://twitter.com/orga_chem Bio - iOS や Web の単体テストを専門としていて、最近は株式会社ディー・エヌ・エーで楽しく賢く価値あるテストを追求している。趣味はテストの声を聴くこと。 Presentation Link - https://speakerdeck.com/orgachem/how-to-use-swiftsyntax-for-better-productivity-japanese-version try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-SwiftSyntax-/"},{"title":"Swift as Light","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Swift as LightSpeaker - Jon-Tait Beason Twitter - https://twitter.com/bugKrusha Bio - Jon-Tait Beason is a iOS software engineer at Glowforge, maker of The 3D Laser Printer. Having a background in education, he enjoys teaching and learning. To that end, he spends a lot of time hanging out in iOS communities where he learns from others and helps engineers who are starting out. Abstract - The Glowforge 3D Laser Printer creates beautiful things out of wood, leather, acrylic and more. By leveraging Coregraphics and other iOS APIs, our app allows users to create and manipulate vector graphics which they can send to their Glowforge. In this talk, we will review how we built some of these features in Swift and how Swift helps to make our solutions more robust, elegant and safe. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Swift-as-Light/"},{"title":"The Philosopher's String","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - The Philosopher’s StringSpeaker - Michael Ilseman Twitter - https://twitter.com/Ilseman Bio - Michael works at Apple on Swift’s Standard Library team. Abstract - Swift’s String type aims to strike an optimal balance between correctness, performance, and ease of use. This talk will explore the philosophy behind String and how we as a community can drive ease of use even further to make programming with String a true joy. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot”Topic - The Philosopher’s String Speaker - Michael Ilseman Twitter - https://twitter.com/Ilseman Bio - Michael works at Apple on Swift’s Standard Library team. Abstract - Swift’s String type aims to strike an optimal balance between correctness, performance, and ease of use. This talk will explore the philosophy behind String and how we as a community can drive ease of use even further to make programming with String a true joy. try! Swift Conf Website - https://tryswift.cotry! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Contact - info@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-The-Philosopher's-String/"},{"title":"The Laws of Magic","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - The Laws of MagicSpeaker - Dave DeLong Twitter - https://twitter.com/davedelong Bio - A seven-year veteran of Apple, Dave DeLong is an accomplished iOS engineer with a passion for teaching, experimentation, and hacking the Objective-C runtime. During his time at Apple, he worked on the UIKit framework, Developer Evangelism, and Apple Maps. He also worked on the Product Experience team at Snap, Inc. Dave, his family, and his large collection of Brandon Sanderson books live near Salt Lake City, where he’s an active member of the local developer community. He can often be found on Twitter teaching developers about all the ways that calendrical calculations can go wrong and pontificating on the virtues of eating chocolate with peanut butter. Abstract - Learn to develop intelligent and immersive experiences by following rules inspired by Sci-Fi and Fantasy fiction. Like software, a complex and engaging magic system uses guidelines to construct a concrete user experience. This talk explores some speculative laws that support fictional world-building and shows how you can incorporate these lessons into your day-to-day app and code development to produce the same result: user engagement, purpose, and a sense of wonder. Presentation Link - https://github.com/tryswift/tokyo2019slides/tree/master/DaveDeLong try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-The-Laws-of-Magic/"},{"title":"try Prototype!","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - try Prototype!Speaker - Maxim Cramer Twitter - https://twitter.com/mennenia Bio - Maxim is a Design Technologist at Autodesk, London. Having previously made iOS keyboards funky at SwiftKey, and contemporary art available at your fingertips with Artsy, she now prototypes exclusively to create the best experiences for VFX studios. She also makes technology accessible for entrepreneurs and startups through technical coaching at MENNENIA and Beluga Bean. Abstract - Why do we really write code? I’ve been wondering: how long is code suppose to live, and just how disposable is it? If our end goal is to deliver great and useful features for our users, is it worth writing disposable code to get to robust code? As good programmers we hone our craft, but let’s look at how can we put all that knowledge to good use so we build the right things, rather than just building things right. try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift New York Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-try-Prototype!/"},{"title":"Using C, C++ and Objective C frameworks in Swift apps","text":"try! Swift Tokyo Conference 2019 - try! Swift is an immersive community gathering about Apple Technologies, Swift Language Best Practices, Application Development in Swift, Server-Side Swift, Open Source Swift, and the Swift Community in Tokyo! Topic - Using C, C++ and Objective C frameworks in Swift appsSpeaker - Cecilia Humlelu Twitter - https://twitter.com/CeciliaHumlelu Bio - I am Cecilia, developer, miniature crafter, acroyogis, and maybe something more. One thing that you might have not guessed about me: I was once a lift truck operator. Abstract - Swift is powerful, it is also relatively new. There are a lot of open source libraries that are written in C, C++ or Objective C. Is there a way to use them all to triple the opportunities to create more unique apps? Yes, we can! In this talk we will go through the basics to explain the relationship among C, C++ and Objective C and demonstrate how to set up the dependencies in a swift project. Presentation Link - https://github.com/TokyoBirdy/Libraries-Slides-Try-Swift.git try! Swift Tokyo Twitter - https://twitter.com/tryswiftconftry! Swift Tokyo Twitter Hashtag - https://twitter.com/hashtag/tryswiftconftry! Swift Website - https://www.tryswift.co/try! Swift Conference Photos - https://www.flickr.com/photos/tryswift/albumstry! Swift Conference Contact - tokyo@tryswift.co try! Swift Conference © 2019 - Powered by NatashaTheRobot","link":"/try-Swift-Tokyo/2019/try!-Swift-Tokyo-2019-Using-C-C++-and-Objective-C-frameworks-in-Swift-apps/"}],"tags":[{"name":"2018","slug":"2018","link":"/tags/2018/"},{"name":"2014","slug":"2014","link":"/tags/2014/"},{"name":"2015","slug":"2015","link":"/tags/2015/"},{"name":"2017","slug":"2017","link":"/tags/2017/"},{"name":"2019","slug":"2019","link":"/tags/2019/"}],"categories":[{"name":"ADDC","slug":"ADDC","link":"/categories/ADDC/"},{"name":"NSSpain","slug":"NSSpain","link":"/categories/NSSpain/"},{"name":"SwiftConf","slug":"SwiftConf","link":"/categories/SwiftConf/"},{"name":"try! Swift Tokyo","slug":"try-Swift-Tokyo","link":"/categories/try-Swift-Tokyo/"}]}